dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
#include "lpc21duino.h"				//lpc21duino for lpc2101/2/3 chips

//global defines

//global variables
//declare pins
//ALL PINS ARE MAPPED, WHETHER THEY EXIST OR NOT
//SO MAKE SURE THAT THE PINS YOU PICKED ACTUALLY EXIST FOR YOUR PACKAGE
//Pin  0.. 7 -> GPIOA
//Pin  8..15 -> GPIOB
const PIN2GPIO GPIO_PinDef[]={
#if defined(LPC_GPIO0)
	{LPC_GPIO0, 1ul<<0},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{LPC_GPIO0, 1ul<<1},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{LPC_GPIO0, 1ul<<2},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{LPC_GPIO0, 1ul<<3},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{LPC_GPIO0, 1ul<<4},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{LPC_GPIO0, 1ul<<5},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{LPC_GPIO0, 1ul<<6},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{LPC_GPIO0, 1ul<<7},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{LPC_GPIO0, 1ul<<8},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{LPC_GPIO0, 1ul<<9},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{LPC_GPIO0, 1ul<<10},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{LPC_GPIO0, 1ul<<11},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{LPC_GPIO0, 1ul<<12},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{LPC_GPIO0, 1ul<<13},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{LPC_GPIO0, 1ul<<14},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{LPC_GPIO0, 1ul<<15},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
	{LPC_GPIO0, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{LPC_GPIO0, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{LPC_GPIO0, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{LPC_GPIO0, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{LPC_GPIO0, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{LPC_GPIO0, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{LPC_GPIO0, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{LPC_GPIO0, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{LPC_GPIO0, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{LPC_GPIO0, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{LPC_GPIO0, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{LPC_GPIO0, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{LPC_GPIO0, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{LPC_GPIO0, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{LPC_GPIO0, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{LPC_GPIO0, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//LPC_GPIO0
#if defined(LPC_GPIO1)
	{LPC_GPIO1, 1ul<<0},						//STM32duino Pin 16 = RP0/PB0/CHIP PIN4
	{LPC_GPIO1, 1ul<<1},						//STM32duino Pin 17 = RP1/PB1/CHIP PIN5
	{LPC_GPIO1, 1ul<<2},						//STM32duino Pin 18 = RP2/PB2/CHIP PIN6
	{LPC_GPIO1, 1ul<<3},						//STM32duino Pin 19 = RP3/PB3/CHIP PIN7
	{LPC_GPIO1, 1ul<<4},						//STM32duino Pin 20 = RP4/PB4/CHIP PIN11
	{LPC_GPIO1, 1ul<<5},						//STM32duino Pin 21 = RP5/PB5/CHIP PIN14
	{LPC_GPIO1, 1ul<<6},						//STM32duino Pin 22 = RP6/PB6/CHIP PIN15
	{LPC_GPIO1, 1ul<<7},						//STM32duino Pin 23 = RP7/PB7/CHIP PIN16
	{LPC_GPIO1, 1ul<<8},						//STM32duino Pin 24 = RP8/PB8/CHIP PIN17
	{LPC_GPIO1, 1ul<<9},						//STM32duino Pin 25 = RP9/PB9/CHIP PIN18
	{LPC_GPIO1, 1ul<<10},						//STM32duino Pin 26 = RP10/PB10/CHIP PIN21
	{LPC_GPIO1, 1ul<<11},						//STM32duino Pin 27 = RP11/PB11/CHIP PIN22
	{LPC_GPIO1, 1ul<<12},						//STM32duino Pin 28 = RP12/PB12/CHIP PIN23
	{LPC_GPIO1, 1ul<<13},						//STM32duino Pin 29 = RP13/PB13/CHIP PIN24
	{LPC_GPIO1, 1ul<<14},						//STM32duino Pin 30 = RP14/PB14/CHIP PIN25
	{LPC_GPIO1, 1ul<<15},						//STM32duino Pin 31 = RP15/PB15/CHIP PIN26
	{LPC_GPIO1, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{LPC_GPIO1, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{LPC_GPIO1, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{LPC_GPIO1, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{LPC_GPIO1, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{LPC_GPIO1, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{LPC_GPIO1, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{LPC_GPIO1, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{LPC_GPIO1, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{LPC_GPIO1, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{LPC_GPIO1, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{LPC_GPIO1, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{LPC_GPIO1, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{LPC_GPIO1, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{LPC_GPIO1, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{LPC_GPIO1, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//LPC_GPIO1
#if defined(LPC_GPIO2)
	{LPC_GPIO2, 1ul<<0},						//STM32duino Pin 32 = RP0/PB0/CHIP PIN4
	{LPC_GPIO2, 1ul<<1},						//STM32duino Pin 33 = RP1/PB1/CHIP PIN5
	{LPC_GPIO2, 1ul<<2},						//STM32duino Pin 34 = RP2/PB2/CHIP PIN6
	{LPC_GPIO2, 1ul<<3},						//STM32duino Pin 35 = RP3/PB3/CHIP PIN7
	{LPC_GPIO2, 1ul<<4},						//STM32duino Pin 36 = RP4/PB4/CHIP PIN11
	{LPC_GPIO2, 1ul<<5},						//STM32duino Pin 37 = RP5/PB5/CHIP PIN14
	{LPC_GPIO2, 1ul<<6},						//STM32duino Pin 38 = RP6/PB6/CHIP PIN15
	{LPC_GPIO2, 1ul<<7},						//STM32duino Pin 39 = RP7/PB7/CHIP PIN16
	{LPC_GPIO2, 1ul<<8},						//STM32duino Pin 40 = RP8/PB8/CHIP PIN17
	{LPC_GPIO2, 1ul<<9},						//STM32duino Pin 41 = RP9/PB9/CHIP PIN18
	{LPC_GPIO2, 1ul<<10},						//STM32duino Pin 42 = RP10/PB10/CHIP PIN21
	{LPC_GPIO2, 1ul<<11},						//STM32duino Pin 43 = RP11/PB11/CHIP PIN22
	{LPC_GPIO2, 1ul<<12},						//STM32duino Pin 44 = RP12/PB12/CHIP PIN23
	{LPC_GPIO2, 1ul<<13},						//STM32duino Pin 45 = RP13/PB13/CHIP PIN24
	{LPC_GPIO2, 1ul<<14},						//STM32duino Pin 46 = RP14/PB14/CHIP PIN25
	{LPC_GPIO2, 1ul<<15},						//STM32duino Pin 47 = RP15/PB15/CHIP PIN26
	{LPC_GPIO2, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{LPC_GPIO2, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{LPC_GPIO2, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{LPC_GPIO2, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{LPC_GPIO2, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{LPC_GPIO2, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{LPC_GPIO2, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{LPC_GPIO2, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{LPC_GPIO2, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{LPC_GPIO2, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{LPC_GPIO2, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{LPC_GPIO2, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{LPC_GPIO2, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{LPC_GPIO2, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{LPC_GPIO2, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{LPC_GPIO2, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//LPC_GPIO2

#if defined(LPC_GPIO3)						//pins 48..63
	{LPC_GPIO3, 1ul<<0},						//STM32duino Pin 32 = RP0/PB0/CHIP PIN4
	{LPC_GPIO3, 1ul<<1},						//STM32duino Pin 33 = RP1/PB1/CHIP PIN5
	{LPC_GPIO3, 1ul<<2},						//STM32duino Pin 34 = RP2/PB2/CHIP PIN6
	{LPC_GPIO3, 1ul<<3},						//STM32duino Pin 35 = RP3/PB3/CHIP PIN7
	{LPC_GPIO3, 1ul<<4},						//STM32duino Pin 36 = RP4/PB4/CHIP PIN11
	{LPC_GPIO3, 1ul<<5},						//STM32duino Pin 37 = RP5/PB5/CHIP PIN14
	{LPC_GPIO3, 1ul<<6},						//STM32duino Pin 38 = RP6/PB6/CHIP PIN15
	{LPC_GPIO3, 1ul<<7},						//STM32duino Pin 39 = RP7/PB7/CHIP PIN16
	{LPC_GPIO3, 1ul<<8},						//STM32duino Pin 40 = RP8/PB8/CHIP PIN17
	{LPC_GPIO3, 1ul<<9},						//STM32duino Pin 41 = RP9/PB9/CHIP PIN18
	{LPC_GPIO3, 1ul<<10},						//STM32duino Pin 42 = RP10/PB10/CHIP PIN21
	{LPC_GPIO3, 1ul<<11},						//STM32duino Pin 43 = RP11/PB11/CHIP PIN22
	{LPC_GPIO3, 1ul<<12},						//STM32duino Pin 44 = RP12/PB12/CHIP PIN23
	{LPC_GPIO3, 1ul<<13},						//STM32duino Pin 45 = RP13/PB13/CHIP PIN24
	{LPC_GPIO3, 1ul<<14},						//STM32duino Pin 46 = RP14/PB14/CHIP PIN25
	{LPC_GPIO3, 1ul<<15},						//STM32duino Pin 47 = RP15/PB15/CHIP PIN26
	{LPC_GPIO3, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{LPC_GPIO3, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{LPC_GPIO3, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{LPC_GPIO3, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{LPC_GPIO3, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{LPC_GPIO3, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{LPC_GPIO3, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{LPC_GPIO3, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{LPC_GPIO3, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{LPC_GPIO3, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{LPC_GPIO3, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{LPC_GPIO3, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{LPC_GPIO3, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{LPC_GPIO3, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{LPC_GPIO3, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{LPC_GPIO3, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//LPC_GPIO3

