dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
#if defined(LPC_GPIO4)						//pins 64..79
	{LPC_GPIO4, 1ul<<0},						//STM32duino Pin 32 = RP0/PB0/CHIP PIN4
	{LPC_GPIO4, 1ul<<1},						//STM32duino Pin 33 = RP1/PB1/CHIP PIN5
	{LPC_GPIO4, 1ul<<2},						//STM32duino Pin 34 = RP2/PB2/CHIP PIN6
	{LPC_GPIO4, 1ul<<3},						//STM32duino Pin 35 = RP3/PB3/CHIP PIN7
	{LPC_GPIO4, 1ul<<4},						//STM32duino Pin 36 = RP4/PB4/CHIP PIN11
	{LPC_GPIO4, 1ul<<5},						//STM32duino Pin 37 = RP5/PB5/CHIP PIN14
	{LPC_GPIO4, 1ul<<6},						//STM32duino Pin 38 = RP6/PB6/CHIP PIN15
	{LPC_GPIO4, 1ul<<7},						//STM32duino Pin 39 = RP7/PB7/CHIP PIN16
	{LPC_GPIO4, 1ul<<8},						//STM32duino Pin 40 = RP8/PB8/CHIP PIN17
	{LPC_GPIO4, 1ul<<9},						//STM32duino Pin 41 = RP9/PB9/CHIP PIN18
	{LPC_GPIO4, 1ul<<10},						//STM32duino Pin 42 = RP10/PB10/CHIP PIN21
	{LPC_GPIO4, 1ul<<11},						//STM32duino Pin 43 = RP11/PB11/CHIP PIN22
	{LPC_GPIO4, 1ul<<12},						//STM32duino Pin 44 = RP12/PB12/CHIP PIN23
	{LPC_GPIO4, 1ul<<13},						//STM32duino Pin 45 = RP13/PB13/CHIP PIN24
	{LPC_GPIO4, 1ul<<14},						//STM32duino Pin 46 = RP14/PB14/CHIP PIN25
	{LPC_GPIO4, 1ul<<15},						//STM32duino Pin 47 = RP15/PB15/CHIP PIN26
	{LPC_GPIO4, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{LPC_GPIO4, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{LPC_GPIO4, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{LPC_GPIO4, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{LPC_GPIO4, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{LPC_GPIO4, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{LPC_GPIO4, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{LPC_GPIO4, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{LPC_GPIO4, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{LPC_GPIO4, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{LPC_GPIO4, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{LPC_GPIO4, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{LPC_GPIO4, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{LPC_GPIO4, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{LPC_GPIO4, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{LPC_GPIO4, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//LPC_GPIO4

#if defined(LPC_GPIO5)						//pins 80..96
	{LPC_GPIO5, 1ul<<0},						//STM32duino Pin 32 = RP0/PB0/CHIP PIN4
	{LPC_GPIO5, 1ul<<1},						//STM32duino Pin 33 = RP1/PB1/CHIP PIN5
	{LPC_GPIO5, 1ul<<2},						//STM32duino Pin 34 = RP2/PB2/CHIP PIN6
	{LPC_GPIO5, 1ul<<3},						//STM32duino Pin 35 = RP3/PB3/CHIP PIN7
	{LPC_GPIO5, 1ul<<4},						//STM32duino Pin 36 = RP4/PB4/CHIP PIN11
	{LPC_GPIO5, 1ul<<5},						//STM32duino Pin 37 = RP5/PB5/CHIP PIN14
	{LPC_GPIO5, 1ul<<6},						//STM32duino Pin 38 = RP6/PB6/CHIP PIN15
	{LPC_GPIO5, 1ul<<7},						//STM32duino Pin 39 = RP7/PB7/CHIP PIN16
	{LPC_GPIO5, 1ul<<8},						//STM32duino Pin 40 = RP8/PB8/CHIP PIN17
	{LPC_GPIO5, 1ul<<9},						//STM32duino Pin 41 = RP9/PB9/CHIP PIN18
	{LPC_GPIO5, 1ul<<10},						//STM32duino Pin 42 = RP10/PB10/CHIP PIN21
	{LPC_GPIO5, 1ul<<11},						//STM32duino Pin 43 = RP11/PB11/CHIP PIN22
	{LPC_GPIO5, 1ul<<12},						//STM32duino Pin 44 = RP12/PB12/CHIP PIN23
	{LPC_GPIO5, 1ul<<13},						//STM32duino Pin 45 = RP13/PB13/CHIP PIN24
	{LPC_GPIO5, 1ul<<14},						//STM32duino Pin 46 = RP14/PB14/CHIP PIN25
	{LPC_GPIO5, 1ul<<15},						//STM32duino Pin 47 = RP15/PB15/CHIP PIN26
	{LPC_GPIO5, 1ul<<16},						//STM32duino Pin  0 = RP0/PB0/CHIP PIN4
	{LPC_GPIO5, 1ul<<17},						//STM32duino Pin  1 = RP1/PB1/CHIP PIN5
	{LPC_GPIO5, 1ul<<18},						//STM32duino Pin  2 = RP2/PB2/CHIP PIN6
	{LPC_GPIO5, 1ul<<19},						//STM32duino Pin  3 = RP3/PB3/CHIP PIN7
	{LPC_GPIO5, 1ul<<20},						//STM32duino Pin  4 = RP4/PB4/CHIP PIN11
	{LPC_GPIO5, 1ul<<21},						//STM32duino Pin  5 = RP5/PB5/CHIP PIN14
	{LPC_GPIO5, 1ul<<22},						//STM32duino Pin  6 = RP6/PB6/CHIP PIN15
	{LPC_GPIO5, 1ul<<23},						//STM32duino Pin  7 = RP7/PB7/CHIP PIN16
	{LPC_GPIO5, 1ul<<24},						//STM32duino Pin  8 = RP8/PB8/CHIP PIN17
	{LPC_GPIO5, 1ul<<25},						//STM32duino Pin  9 = RP9/PB9/CHIP PIN18
	{LPC_GPIO5, 1ul<<26},						//STM32duino Pin 10 = RP10/PB10/CHIP PIN21
	{LPC_GPIO5, 1ul<<27},						//STM32duino Pin 11 = RP11/PB11/CHIP PIN22
	{LPC_GPIO5, 1ul<<28},						//STM32duino Pin 12 = RP12/PB12/CHIP PIN23
	{LPC_GPIO5, 1ul<<29},						//STM32duino Pin 13 = RP13/PB13/CHIP PIN24
	{LPC_GPIO5, 1ul<<30},						//STM32duino Pin 14 = RP14/PB14/CHIP PIN25
	{LPC_GPIO5, 1ul<<31},						//STM32duino Pin 15 = RP15/PB15/CHIP PIN26
#endif	//LPC_GPIO5
};

//global variables

volatile uint32_t SystemCoreClock;;				//system coreclock - needs to be updated
volatile uint32_t AHBClock;						//ahb clock rate
volatile uint32_t APBClock;						//=Pclk

//update systemcoreclock - for comptability with cmsis
uint32_t SystemCoreClockUpdate(void) {
	uint32_t tmp = F_XTAL;						//temp var holding the clock frequency
	
	//calculate the clock value
	//bit 8: PLLE (enable bit), bit 9: PLLC (connection bit)
	if (PLLSTAT & (0x03<<8)) {					//pll is enabled and connected
			tmp *= 1+(PLLSTAT & 0x1f);			//pll multiplier
			//tmp>>= 1+((PLLSTAT >> 5) & 0x03);	//pll divider
	}
	SystemCoreClock = tmp;

	//calculate ahb clock
	AHBClock = SystemCoreClock;

	//calclate apb clock (=PCLK)
	tmp = F_CPU;
	switch (APBDIV & 0x03) {
		case 0x00: tmp /= 4; break;					//this is the default
		case 0x01: tmp /= 1; break;					//fastest
		case 0x02: tmp /= 2; break;					//alternative
	}
	APBClock = tmp;
	//return with the clock value
	return SystemCoreClock;
}

//get AHB speed (=CCLK)?
//on this chip, ahb peripheral clock = cpu clock / 1 - needs verification
//AHB only feeds Vectored Interrupt Controller, per the datasheet

//get APB speed (=PCLK)
//on this chip, apb peripheral clock = cpu clock / apbdiv
void __irq DefISR(void);

//reset the mcu
void mcuInit(void) {
	PCONP  = 0;						//0->disable all periopherals by default
#if defined(USE_FGPIO)
	SCS   |= (1<<0);				//1->fast gpio, 0->legacy gpio
#else
	SCS   &=~(1<<0);				//1->fast gpio, 0->legacy gpio
#endif
	APBDIV = 	(APBDIV &~(0x03<<0)) |
				(0x00<<0);			//0->PCLK=CCLK/4, 1->PCLK = CCLK / 1, 2->PCLK = CCLK/2
	
