dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
	//select the clock source
	//clock configuration doen via Startup.s

	//update SystemCoreClock
	SystemCoreClockUpdate();
	
	//start timer0 as systick / coretick
	tmr0Init();

	VICDefVectAddr = (uint32_t )DefISR; // set interrupt vector in DefISR

	//enable global interrupts
	ei();							//testing
}

//empty interrupt handler
void empty_handler(void) {
	//do nothing here
}

//C main loop
int main(void) {

	mcuInit();						//reset the mcu
	setup();						//run the setup code
	while (1) {
		loop();						//run the default loop
	}
}


//Arduino Functions: GPIO
//set a pin mode to INPUT or OUTPUT
//no error checking on PIN
void pinMode(PIN_TypeDef pin, uint8_t mode) {
	if (mode==OUTPUT) IO_OUT(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	else IO_IN(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
}

//set / clear a pin
void digitalWrite(PIN_TypeDef pin, uint8_t val) {
	if (val==LOW) IO_CLR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	else IO_SET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
}

//read a pin
int digitalRead(PIN_TypeDef pin) {
	return (IO_GET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask))?HIGH:LOW;
}
//end GPIO

//ticks()
//Arduino Functions: Time
//return timer ticks
	
//delay millisseconds
//void delay(uint32_t ms) {
//	uint32_t start_time = ticks();
//	ms *= cyclesPerMillisecond();
//	while (ticks() - start_time < ms) continue;
//}

//delay micros seconds
//void delayMicroseconds(uint32_t us) {
//	uint32_t start_time = ticks();
//	us *= cyclesPerMicrosecond();
//	while (ticks() - start_time < us) continue;
//}
//delay ticks
void delayTks(uint32_t tks) {
	uint32_t start_time = ticks();
	while (ticks() - start_time < tks) continue;
}
//end Time

//non vectored interrupt
//uart0/1 isr pointers
volatile char *_U0TX_ptr;
volatile char *_U1TX_ptr;

//non-vectored isr
void u0tx_isr(void);
void u1tx_isr(void);
void __irq DefISR(void) {
	uint32_t tmp;
#if defined(USE_U0TXISR)
	tmp=U0IIR;								//read the flag and clears it by reading it
	switch (tmp & (0x07<<1)) {
		case (0x01<<1): u0tx_isr(); break;	//0x01->THRE interrupt
	}
#endif

#if defined(USE_U1TXISR)
	tmp=U1IIR;								//read the flag and clears it by reading it
	switch (tmp & (0x07<<1)) {
		case (0x01<<1): u1tx_isr(); break;	//0x01->THRE interrupt
	}
#endif

	VICVectAddr = 0x00000000; 				//Dummy write to signal end of interrupt
}

//set up timer0
//systick handler - to provide time base for millis()/micros()
//pointer to user handler
static void (* _t0mr0_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t0mr1_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t0mr2_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t0mr3_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t0ic0_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t0ic1_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t0ic2_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t0ic3_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler

//shadow period registers - 32-bit timer
static uint32_t _t0pr0=0x0000;				//mr0 fixed at 0xfffffffful/0x00000000ul
static uint32_t _t0pr1=0x0000;
static uint32_t _t0pr2=0x0000;
static uint32_t _t0pr3=0x0000;

//timer0 isr
void __irq T0ISR(void) {
	//match channel 0
	if (T0IR & (1<<0)) {
		T0IR = 1<<0;						//clear the flag by writing 1 to it, writing 0 has no effect
		T0MR0+= _t0pr0;						//update match register
		_t0mr0_ptr();						//execute user handler
	}

	//match channel 1
	if (T0IR & (1<<1)) {
		T0IR = 1<<1;						//clear the flag by writing 1 to it
		T0MR1+= _t0pr1;						//update match register
		_t0mr1_ptr();						//execute user handler
	}

	//match channel 2
	if (T0IR & (1<<2)) {
		T0IR = 1<<2;						//clear the flag by writing 1 to it
		T0MR2+= _t0pr2;						//update match register
		_t0mr2_ptr();						//execute user handler
	}

	//match channel 3
	if (T0IR & (1<<3)) {
		T0IR = 1<<3;						//clear the flag by writing 1 to it
		T0MR3+= _t0pr3;						//update match register
		_t0mr3_ptr();						//execute user handler
	}

	//input capture 0
	if (T0IR & (1<<4)) {
		T0IR = 1<<4;						//clear the flag by writing 1 to it
		_t0ic0_ptr();						//execute user handler
	}

	//input capture 1
	if (T0IR & (1<<5)) {
		T0IR = 1<<5;						//clear the flag by writing 1 to it
		_t0ic1_ptr();						//execute user handler
	}

	//input capture 2
	if (T0IR & (1<<6)) {
		T0IR = 1<<6;						//clear the flag by writing 1 to it
		_t0ic2_ptr();						//execute user handler
	}

	//input capture 3
	if (T0IR & (1<<7)) {
		T0IR = 1<<7;						//clear the flag by writing 1 to it
		_t0ic3_ptr();						//execute user handler
	}

	VICVectAddr = 0x00000000; 				//Dummy write to signal end of interrupt
}

//initialize timer0
void tmr0Init(void) {
	PCONP |= 1<<1;				//enable clock: 1: timer0, 2: timer1, 22: timer2, 23: timer3

	//configure timer0 mr0 channel as systick generator
	//stop the timer
	T0TCR = 1<<1;				//1=reset and disable the timer

	T0CTCR = 0;					//0->timer mode
	T0TCR&=~0x03;				//reset bit 1..0->count on rising edge of pclk
	T0TC = 0;					//reset counter - optional
	T0PC = 0;					//reset prescaler counter to 0
	T0PR = 0;					//set prescaler to 1:1
	T0MCR= 0;	//(T0MCR & ~(0x07 << (3*0))) |
				//(0x00 << (3*0));	//set up the match register. no interrupt yet
	T0TCR = 1;					//start the timer
}

//install user handler for IC0
void tmr0IC0AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t0ic0_ptr = isr_ptr;

	//clear the flag
	T0IR = 1<<4;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T0CTCR = (T0CTCR & ~(0x03 << 2)) | (0 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T0CCR= 	(T0CCR & ~(0x07 << (3*0))) |
			(0x01 << (3*0)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*0));					//0->disable interrput, 4->enable interrupt

