dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
	//configure the capture pin
#if defined(IC00_PIN)
	IC00_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 4 used for tmr0
	VICVectAddr4 = (uint32_t )T0ISR;      		// set interrupt vector in 0
  	VICVectCntl4 = (1<<5) | 4;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<4);						// Enable Timer0 Interrupt. turn on irq4
}

//install user handler for IC1
void tmr0IC1AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t0ic1_ptr = isr_ptr;

	//clear the flag
	T0IR = 1<<5;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T0CTCR = (T0CTCR & ~(0x03 << 2)) | (1 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T0CCR= 	(T0CCR & ~(0x07 << (3*1))) |
			(0x01 << (3*1)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*1));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC01_PIN)
	IC01_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 4 used for tmr0
	VICVectAddr4 = (uint32_t )T0ISR;      		// set interrupt vector in 0
  	VICVectCntl4 = (1<<5) | 4;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<4);						// Enable Timer0 Interrupt. turn on irq4
}

//install user handler for IC2
void tmr0IC2AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t0ic2_ptr = isr_ptr;

	//clear the flag
	T0IR = 1<<6;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T0CTCR = (T0CTCR & ~(0x03 << 2)) | (2 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T0CCR= 	(T0CCR & ~(0x07 << (3*2))) |
			(0x01 << (3*2)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*2));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC02_PIN)
	IC02_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 4 used for tmr0
	VICVectAddr4 = (uint32_t )T0ISR;      		// set interrupt vector in 0
  	VICVectCntl4 = (1<<5) | 4;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<4);						// Enable Timer0 Interrupt. turn on irq4
}

//install user handler for IC3
void tmr0IC3AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t0ic3_ptr = isr_ptr;

	//clear the flag
	T0IR = 1<<7;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T0CTCR = (T0CTCR & ~(0x03 << 2)) | (3 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T0CCR= 	(T0CCR & ~(0x07 << (3*3))) |
			(0x01 << (3*3)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*3));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC03_PIN)
	IC03_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 4 used for tmr0
	VICVectAddr4 = (uint32_t )T0ISR;      		// set interrupt vector in 0
  	VICVectCntl4 = (1<<5) | 4;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<4);						// Enable Timer0 Interrupt. turn on irq4
}

//set up the match channels
void tmr0OC0SetPR(uint32_t pr) {
	//clear the flag
	T0IR = 1<<0;							//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*0))) |
				(0x00 << (3*0));			//set up the match register. no interrupt yet
	T0MR0= _t0pr0 = pr - 0;

}

//read timer period
uint32_t tmr0OC0GetPR(void) {
	return _t0pr0;
}

//install user handler
void tmr0OC0AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t0mr0_ptr = isr_ptr;

	//clear the flag
	T0IR = 1<<0;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*0))) |
				(0x01 << (3*0));	//set up the match register. interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 4 used for tmr0
	VICVectAddr4 = (uint32_t )T0ISR;      		// set interrupt vector in 0
  	VICVectCntl4 = (1<<5) | 4;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<4);						// Enable Timer0 Interrupt. turn on irq4

}

//set up the match
void tmr0OC1SetPR(uint32_t pr) {
	//clear the flag
	T0IR = 1<<1;					//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*1))) |
				(0x00 << (3*1));	//set up the match register. no interrupt yet
	T0MR1= _t0pr1 = pr - 0;

}

//read timer period
uint32_t tmr0OC1GetPR(void) {
	return _t0pr1;
}

//install user handler
void tmr0OC1AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t0mr1_ptr = isr_ptr;

	//clear the flag
	T0IR = 1<<1;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*1))) |
				(0x01 << (3*1));	//set up the match register. enable interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 4 used for tmr0
	VICVectAddr4 = (uint32_t )T0ISR;      		// set interrupt vector in 0
  	VICVectCntl4 = (1<<5) | 4;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<4);						// Enable Timer0 Interrupt. turn on irq4
}

//set up the match
void tmr0OC2SetPR(uint32_t pr) {
	//clear the flag
	T0IR = 1<<2;					//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*2))) |
				(0x00 << (3*2));	//set up the match register. no interrupt yet
	T0MR2= _t0pr2 = pr - 0;

}

//read timer period
uint32_t tmr0OC2GetPR(void) {
	return _t0pr2;
}

