dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
//install user handler
void tmr0OC2AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t0mr2_ptr = isr_ptr;

	//clear the flag
	T0IR = 1<<2;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*2))) |
				(0x01 << (3*2));	//set up the match register. enable interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 4 used for tmr0
	VICVectAddr4 = (uint32_t )T0ISR;      		// set interrupt vector in 0
  	VICVectCntl4 = (1<<5) | 4;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<4);						// Enable Timer0 Interrupt. turn on irq4
}

//set up the match
void tmr0OC3SetPR(uint32_t pr) {
	//clear the flag
	T0IR = 1<<3;					//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*3))) |
				(0x00 << (3*3));	//set up the match register. no interrupt yet
	T0MR3= _t0pr3 = pr - 0;

}

//read timer period
uint32_t tmr0OC3GetPR(void) {
	return _t0pr3;
}

//install user handler
void tmr0OC3AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t0mr3_ptr = isr_ptr;

	//clear the flag
	T0IR = 1<<3;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*3))) |
				(0x01 << (3*3));	//set up the match register. enable interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 4 used for tmr0
	VICVectAddr4 = (uint32_t )T0ISR;      		// set interrupt vector in 0
  	VICVectCntl4 = (1<<5) | 4;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<4);						// Enable Timer0 Interrupt. turn on irq4
}

//generate pwm output
void tmr0PWM0Init(void) {
	//don't enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*0))) |
				(0x00 << (3*0));				//set up the match register. no interrupt yet
	T0EMR=	(T0EMR & ~(0x03 << 4)) |
			(0x02 << 4);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T0PWMCON=(T0PWMCON &~(1<<0)) | (1<<0);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM00_PIN)
	PWM00_PIN();								//enable the output pin
#endif
}

//generate pwm output
void tmr0PWM1Init(void) {
	//don't enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*1))) |
				(0x00 << (3*1));				//set up the match register. no interrupt yet
	T0EMR=	(T0EMR & ~(0x03 << 6)) |
			(0x02 << 6);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T0PWMCON=(T0PWMCON &~(1<<1)) | (1<<1);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM01_PIN)
	PWM01_PIN();								//enable the output pin
#endif
}

//generate pwm output
void tmr0PWM2Init(void) {
	//don't enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*2))) |
				(0x00 << (3*2));				//set up the match register. no interrupt yet
	T0EMR=	(T0EMR & ~(0x03 << 8)) |
			(0x02 << 8);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T0PWMCON=(T0PWMCON &~(1<<2)) | (1<<2);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM02_PIN)
	PWM02_PIN();								//enable the output pin
#endif
}

//generate pwm output - this resets the pwm period
void tmr0PWM3Init(void) {
	//don't enable interrupt
	T0MCR= 	(T0MCR & ~(0x07 << (3*3))) |
				(0x02 << (3*3));				//set up the match register. 2: reset on match, no interrupt yet
	T0EMR=	(T0EMR & ~(0x03 <<10)) |
			(0x00 <<10);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T0PWMCON=(T0PWMCON &~(1<<3)) | (1<<3);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM03_PIN)
	PWM03_PIN();								//enable the output pin
#endif
}

//end timer0

//set up timer1
//systick handler - to provide time base for millis()/micros()
//pointer to user handler
static void (* _t1mr0_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t1mr1_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t1mr2_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t1mr3_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t1ic0_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t1ic1_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t1ic2_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler
static void (* _t1ic3_ptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler

//shadow period registers - 32-bit timer
static uint32_t _t1pr0=0x0000;				//mr0 fixed at 0xfffffffful/0x00000000ul
static uint32_t _t1pr1=0x0000;
static uint32_t _t1pr2=0x0000;
static uint32_t _t1pr3=0x0000;

//timer1 isr
void __irq T1ISR(void) {
	//match channel 0
	if (T1IR & (1<<0)) {
		T1IR = 1<<0;						//clear the flag by writing 1 to it
		T1MR0+= _t1pr0;						//update match register
		_t1mr0_ptr();						//execute user handler
	}

	//match channel 1
	if (T1IR & (1<<1)) {
		T1IR = 1<<1;						//clear the flag by writing 1 to it
		T1MR1+= _t1pr1;						//update match register
		_t1mr1_ptr();						//execute user handler
	}

	//match channel 2
	if (T1IR & (1<<2)) {
		T1IR = 1<<2;						//clear the flag by writing 1 to it
		T1MR2+= _t1pr2;						//update match register
		_t1mr2_ptr();						//execute user handler
	}

	//match channel 3
	if (T1IR & (1<<3)) {
		T1IR = 1<<3;						//clear the flag by writing 1 to it
		T1MR3+= _t1pr3;						//update match register
		_t1mr3_ptr();						//execute user handler
	}
	
	//input capture 0
	if (T1IR & (1<<4)) {
		T1IR = 1<<4;
		_t1ic0_ptr();
	}

	//input capture 1
	if (T1IR & (1<<5)) {
		T1IR = 1<<5;
		_t1ic1_ptr();
	}

	//input capture 2
	if (T1IR & (1<<5)) {
		T1IR = 1<<5;
		_t1ic2_ptr();
	}

	//input capture 3
	if (T1IR & (1<<6)) {
		T1IR = 1<<6;
		_t1ic3_ptr();
	}

	VICVectAddr = 0x00000000; 				//Dummy write to signal end of interrupt
}

//initialize timer0
void tmr1Init(void) {
	PCONP |= 1<<2;				//enable clock: 1: timer0, 2: timer1, 22: timer2, 23: timer3

