dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
	//configure timer0 mr0 channel as systick generator
	//stop the timer
	T1TCR = 1<<1;				//1=reset and disable the timer

	T1CTCR = 0;					//0->timer mode
	T1TCR&=~0x03;				//reset bit 1..0->count on rising edge of pclk
	T1TC = 0;					//reset counter - optional
	T1PC = 0;					//reset prescaler counter to 0
	T1PR = 0;					//set prescaler to 1:1
	T1MCR= 0;	//(T1MCR & ~(0x07 << (3*0))) |
				//(0x00 << (3*0));	//set up the match register. no interrupt yet
	T1TCR = 1;					//start the timer
}

//install user handler for IC0
void tmr1IC0AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t1ic0_ptr = isr_ptr;

	//clear the flag
	T1IR = 1<<4;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T1CTCR = (T1CTCR & ~(0x03 << 2)) | (0 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T1CCR= 	(T1CCR & ~(0x07 << (3*0))) |
			(0x01 << (3*0)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*0));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC10_PIN)
	IC10_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 5 used for tmr1
	VICVectAddr5 = (uint32_t )T1ISR;      		// set interrupt vector in 0
  	VICVectCntl5 = (1<<5) | 5;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<5);						// Enable Timer0 Interrupt. turn on irq4
}

//install user handler for IC1
void tmr1IC1AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t1ic1_ptr = isr_ptr;

	//clear the flag
	T1IR = 1<<5;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T1CTCR = (T1CTCR & ~(0x03 << 2)) | (1 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T1CCR= 	(T1CCR & ~(0x07 << (3*1))) |
			(0x01 << (3*1)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*1));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC11_PIN)
	IC11_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 5 used for tmr1
	VICVectAddr5 = (uint32_t )T1ISR;      		// set interrupt vector in 0
  	VICVectCntl5 = (1<<5) | 5;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<5);						// Enable Timer0 Interrupt. turn on irq4
}


//install user handler for IC2
void tmr1IC2AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t1ic2_ptr = isr_ptr;

	//clear the flag
	T1IR = 1<<6;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T1CTCR = (T1CTCR & ~(0x03 << 2)) | (2 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T1CCR= 	(T1CCR & ~(0x07 << (3*2))) |
			(0x01 << (3*2)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*2));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC12_PIN)
	IC12_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 5 used for tmr1
	VICVectAddr5 = (uint32_t )T1ISR;      		// set interrupt vector in 0
  	VICVectCntl5 = (1<<5) | 5;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<5);						// Enable Timer0 Interrupt. turn on irq4
}


//install user handler for IC0
void tmr1IC3AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t1ic3_ptr = isr_ptr;

	//clear the flag
	T1IR = 1<<6;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T1CTCR = (T1CTCR & ~(0x03 << 2)) | (3 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T1CCR= 	(T1CCR & ~(0x07 << (3*3))) |
			(0x01 << (3*3)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*3));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC13_PIN)
	IC13_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 5 used for tmr1
	VICVectAddr5 = (uint32_t )T1ISR;      		// set interrupt vector in 0
  	VICVectCntl5 = (1<<5) | 5;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<5);						// Enable Timer0 Interrupt. turn on irq4
}

//set up the match channels
void tmr1OC0SetPR(uint32_t pr) {
	//clear the flag
	T1IR = 1<<0;							//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T1MCR= 	(T1MCR & ~(0x07 << (3*0))) |
				(0x00 << (3*0));			//set up the match register. no interrupt yet
	T1MR0= _t1pr0 = pr - 0;

}

//read timer period
uint32_t tmr1OC0GetPR(void) {
	return _t1pr0;
}

//install user handler
void tmr1OC0AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t1mr0_ptr = isr_ptr;

	//clear the flag
	T1IR = 1<<0;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T1MCR= 	(T1MCR & ~(0x07 << (3*0))) |
				(0x01 << (3*0));	//set up the match register. interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 5 used for tmr1
	VICVectAddr5 = (uint32_t )T1ISR;      		// set interrupt vector in 0
  	VICVectCntl5 = (1<<5) | 5;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<5);						// Enable Timer0 Interrupt. turn on irq4

}

//set up the match
void tmr1OC1SetPR(uint32_t pr) {
	//clear the flag
	T1IR = 1<<1;					//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T1MCR= 	(T1MCR & ~(0x07 << (3*1))) |
				(0x00 << (3*1));	//set up the match register. no interrupt yet
	T1MR1= _t1pr1 = pr - 0;

