dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
	//input capture 0
	if (T2IR & (1<<4)) {
		T2IR = 1<<4;						//clear the flag by writing 1 to it
		_t2ic0_ptr();						//execute user handler
	}

	//input capture 1
	if (T2IR & (1<<5)) {
		T2IR = 1<<5;						//clear the flag by writing 1 to it
		_t2ic1_ptr();						//execute user handler
	}

	//input capture 2
	if (T2IR & (1<<6)) {
		T2IR = 1<<6;						//clear the flag by writing 1 to it
		_t2ic2_ptr();						//execute user handler
	}

	//input capture 3
	if (T2IR & (1<<7)) {
		T2IR = 1<<7;						//clear the flag by writing 1 to it
		_t2ic3_ptr();						//execute user handler
	}

	VICVectAddr = 0x00000000; 				//Dummy write to signal end of interrupt
}

//initialize timer0
void tmr2Init(void) {
	PCONP |= 1<<22;				//enable clock: 1: timer0, 2: timer1, 22: timer2, 23: timer3

	//configure timer0 mr0 channel as systick generator
	//stop the timer
	T2TCR = 1<<1;				//1=reset and disable the timer

	T2CTCR = 0;					//0->timer mode
	T2TCR&=~0x03;				//reset bit 1..0->count on rising edge of pclk
	T2TC = 0;					//reset counter - optional
	T2PC = 0;					//reset prescaler counter to 0
	T2PR = 0;					//set prescaler to 1:1
	T2MCR= 0;	//(T2MCR & ~(0x07 << (3*0))) |
				//(0x00 << (3*0));	//set up the match register. no interrupt yet
	T2TCR = 1;					//start the timer
}

//set up the match channels
void tmr2OC0SetPR(uint32_t pr) {
	//clear the flag
	T2IR = 1<<0;							//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*0))) |
				(0x00 << (3*0));			//set up the match register. no interrupt yet
	T2MR0= _t2pr0 = pr - 0;

}

//install user handler for IC0
void tmr2IC0AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t2ic0_ptr = isr_ptr;

	//clear the flag
	T2IR = 1<<4;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T2CTCR = (T2CTCR & ~(0x03 << 2)) | (0 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T2CCR= 	(T2CCR & ~(0x07 << (3*0))) |
			(0x01 << (3*0)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*0));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC20_PIN)
	IC20_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 14 used for tmr2
	VICVectAddr14 = (uint32_t )T2ISR;      		// set interrupt vector in 0
  	VICVectCntl14 = (1<<5) | 26;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<26);						// Enable Timer0 Interrupt. turn on irq4
}

//install user handler for IC1
void tmr2IC1AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t2ic1_ptr = isr_ptr;

	//clear the flag
	T2IR = 1<<5;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T2CTCR = (T2CTCR & ~(0x03 << 2)) | (1 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T2CCR= 	(T2CCR & ~(0x07 << (3*1))) |
			(0x01 << (3*1)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*1));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC21_PIN)
	IC21_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 14 used for tmr2
	VICVectAddr14 = (uint32_t )T2ISR;      		// set interrupt vector in 0
  	VICVectCntl14 = (1<<5) | 26;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<26);						// Enable Timer0 Interrupt. turn on irq4
}

//install user handler for IC2
void tmr2IC2AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t2ic2_ptr = isr_ptr;

	//clear the flag
	T2IR = 1<<6;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T2CTCR = (T2CTCR & ~(0x03 << 2)) | (2 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T2CCR= 	(T2CCR & ~(0x07 << (3*2))) |
			(0x01 << (3*2)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*2));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC22_PIN)
	IC22_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 14 used for tmr2
	VICVectAddr14 = (uint32_t )T2ISR;      		// set interrupt vector in 0
  	VICVectCntl14 = (1<<5) | 26;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<26);						// Enable Timer0 Interrupt. turn on irq4
}


//install user handler for IC3
void tmr2IC3AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t2ic3_ptr = isr_ptr;

	//clear the flag
	T2IR = 1<<7;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T2CTCR = (T2CTCR & ~(0x03 << 2)) | (3 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T2CCR= 	(T2CCR & ~(0x07 << (3*3))) |
			(0x01 << (3*3)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*3));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC23_PIN)
	IC23_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 14 used for tmr2
	VICVectAddr14 = (uint32_t )T2ISR;      		// set interrupt vector in 0
  	VICVectCntl14 = (1<<5) | 26;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<26);						// Enable Timer0 Interrupt. turn on irq4
}

//read timer period
uint32_t tmr2OC0GetPR(void) {
	return _t2pr0;
}

//install user handler
void tmr2OC0AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t2mr0_ptr = isr_ptr;

	//clear the flag
	T2IR = 1<<0;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*0))) |
				(0x01 << (3*0));	//set up the match register. interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 14 used for tmr2
	VICVectAddr14 = (uint32_t )T2ISR;      		// set interrupt vector in 0
  	VICVectCntl14 = (1<<5) | 26;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<26);						// Enable Timer0 Interrupt. turn on irq4

