dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
}

//set up the match
void tmr2OC1SetPR(uint32_t pr) {
	//clear the flag
	T2IR = 1<<1;					//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*1))) |
				(0x00 << (3*1));	//set up the match register. no interrupt yet
	T2MR1= _t2pr1 = pr - 0;

}

//read timer period
uint32_t tmr2OC1GetPR(void) {
	return _t2pr1;
}

//install user handler
void tmr2OC1AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t2mr1_ptr = isr_ptr;

	//clear the flag
	T2IR = 1<<1;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*1))) |
				(0x01 << (3*1));	//set up the match register. enable interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 14 used for tmr2
	VICVectAddr14 = (uint32_t )T2ISR;      		// set interrupt vector in 0
  	VICVectCntl14 = (1<<5) | 26;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<26);						// Enable Timer0 Interrupt. turn on irq4
}

//set up the match
void tmr2OC2SetPR(uint32_t pr) {
	//clear the flag
	T2IR = 1<<2;					//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*2))) |
				(0x00 << (3*2));	//set up the match register. no interrupt yet
	T2MR2= _t2pr2 = pr - 0;

}

//read timer period
uint32_t tmr2OC2GetPR(void) {
	return _t2pr2;
}

//install user handler
void tmr2OC2AttachISR2(void (*isr_ptr)(void)) {
	//install user handler
	_t2mr2_ptr = isr_ptr;

	//clear the flag
	T2IR = 1<<2;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*2))) |
				(0x01 << (3*2));	//set up the match register. enable interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 14 used for tmr2
	VICVectAddr14 = (uint32_t )T2ISR;      		// set interrupt vector in 0
  	VICVectCntl14 = (1<<5) | 26;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<26);						// Enable Timer1 Interrupt. turn on irq5
}

//set up the match
void tmr2OC3SetPR(uint32_t pr) {
	//clear the flag
	T2IR = 1<<3;					//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*3))) |
				(0x00 << (3*3));	//set up the match register. no interrupt yet
	T2MR3= _t2pr3 = pr - 0;

}

//read timer period
uint32_t tmr2OC3GetPR(void) {
	return _t2pr3;
}

//install user handler
void tmr2OC3AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t2mr3_ptr = isr_ptr;

	//clear the flag
	T2IR = 1<<3;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*3))) |
				(0x01 << (3*3));	//set up the match register. enable interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 14 used for tmr2
	VICVectAddr14 = (uint32_t )T2ISR;      		// set interrupt vector in 0
  	VICVectCntl14 = (1<<5) | 26;				// use it for Timer 1 Interrupt. irq5 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<26);						// Enable Timer1 Interrupt. turn on irq5
}

//generate pwm output
void tmr2PWM0Init(void) {
	//don't enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*0))) |
				(0x00 << (3*0));				//set up the match register. no interrupt yet
	T2EMR=	(T2EMR & ~(0x03 << 4)) |
			(0x02 << 4);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T2PWMCON=(T2PWMCON &~(1<<0)) | (1<<0);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM20_PIN)
	PWM20_PIN();								//enable the output pin
#endif
}

//generate pwm output
void tmr2PWM1Init(void) {
	//don't enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*1))) |
				(0x00 << (3*1));				//set up the match register. no interrupt yet
	T2EMR=	(T2EMR & ~(0x03 << 6)) |
			(0x02 << 6);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T2PWMCON=(T2PWMCON &~(1<<1)) | (1<<1);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM21_PIN)
	PWM21_PIN();								//enable the output pin
#endif
}

//generate pwm output
void tmr2PWM2Init(void) {
	//don't enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*2))) |
				(0x00 << (3*2));				//set up the match register. no interrupt yet
	T2EMR=	(T2EMR & ~(0x03 << 8)) |
			(0x02 << 8);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T2PWMCON=(T2PWMCON &~(1<<2)) | (1<<2);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM22_PIN)
	PWM22_PIN();								//enable the output pin
#endif
}

//generate pwm output - this resets the pwm period
void tmr2PWM3Init(void) {
	//don't enable interrupt
	T2MCR= 	(T2MCR & ~(0x07 << (3*3))) |
				(0x02 << (3*3));				//set up the match register. 2: reset on match, no interrupt yet
	T2EMR=	(T2EMR & ~(0x03 <<10)) |
			(0x00 <<10);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T2PWMCON=(T2PWMCON &~(1<<3)) | (1<<3);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM23_PIN)
	PWM23_PIN();								//enable the output pin
#endif
}

//end timer2

//set up timer3
//systick handler - to provide time base for millis()/micros()
//pointer to user handler
static void (* _t3mr0_ptr)(void)=empty_handler;				//tmr3_ptr pointing to empty_handler
static void (* _t3mr1_ptr)(void)=empty_handler;				//tmr3_ptr pointing to empty_handler
static void (* _t3mr2_ptr)(void)=empty_handler;				//tmr3_ptr pointing to empty_handler
static void (* _t3mr3_ptr)(void)=empty_handler;				//tmr3_ptr pointing to empty_handler
static void (* _t3ic0_ptr)(void)=empty_handler;				//tmr3_ptr pointing to empty_handler
static void (* _t3ic1_ptr)(void)=empty_handler;				//tmr3_ptr pointing to empty_handler
static void (* _t3ic2_ptr)(void)=empty_handler;				//tmr3_ptr pointing to empty_handler
static void (* _t3ic3_ptr)(void)=empty_handler;				//tmr3_ptr pointing to empty_handler

//shadow period registers - 16-bit timer
static uint32_t _t3pr0=0x0000;				//mr0 fixed at 0xfffffffful/0x00000000ul
static uint32_t _t3pr1=0x0000;
static uint32_t _t3pr2=0x0000;
static uint32_t _t3pr3=0x0000;

//timer1 isr
void __irq T3ISR(void) {
	//match channel 0
	if (T3IR & (1<<0)) {
		T3IR = 1<<0;						//clear the flag by writing 1 to it
		T3MR0+= _t3pr0;						//update match register
		_t3mr0_ptr();						//execute user handler
	}

	//match channel 1
	if (T3IR & (1<<1)) {
		T3IR = 1<<1;						//clear the flag by writing 1 to it
		T3MR1+= _t3pr1;						//update match register
		_t3mr1_ptr();						//execute user handler
	}

	//match channel 2
	if (T3IR & (1<<2)) {
		T3IR = 1<<2;						//clear the flag by writing 1 to it
		T3MR2+= _t3pr2;						//update match register
		_t3mr2_ptr();						//execute user handler
	}

	//match channel 3
	if (T3IR & (1<<3)) {
		T3IR = 1<<3;						//clear the flag by writing 1 to it
		T3MR3+= _t3pr3;						//update match register
		_t3mr3_ptr();						//execute user handler
	}

