dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
	//input capture 0
	if (T3IR & (1<<4)) {
		T3IR = 1<<4;						//clear the flag by writing 1 to it
		_t3ic0_ptr();						//execute user handler
	}

	//input capture 1
	if (T3IR & (1<<5)) {
		T3IR = 1<<5;						//clear the flag by writing 1 to it
		_t3ic1_ptr();						//execute user handler
	}

	//input capture 2
	if (T3IR & (1<<6)) {
		T3IR = 1<<6;						//clear the flag by writing 1 to it
		_t3ic2_ptr();						//execute user handler
	}

	//input capture 3
	if (T3IR & (1<<7)) {
		T3IR = 1<<7;						//clear the flag by writing 1 to it
		_t3ic3_ptr();						//execute user handler
	}
	
	VICVectAddr = 0x00000000; 				//Dummy write to signal end of interrupt
}

//initialize timer0
void tmr3Init(void) {
	PCONP |= 1<<23;				//enable clock: 1: timer0, 2: timer1, 22: timer2, 23: timer3

	//configure timer0 mr0 channel as systick generator
	//stop the timer
	T3TCR = 1<<1;				//1=reset and disable the timer

	T3CTCR = 0;					//0->timer mode
	T3TCR&=~0x03;				//reset bit 1..0->count on rising edge of pclk
	T3TC = 0;					//reset counter - optional
	T3PC = 0;					//reset prescaler counter to 0
	T3PR = 0;					//set prescaler to 1:1
	T3MCR= 0;	//(T3MCR & ~(0x07 << (3*0))) |
				//(0x00 << (3*0));	//set up the match register. no interrupt yet
	T3TCR = 1;					//start the timer
}

//input capture
//install user handler for IC0
void tmr3IC0AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t3ic0_ptr = isr_ptr;

	//clear the flag
	T3IR = 1<<4;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T3CTCR = (T3CTCR & ~(0x03 << 2)) | (0 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T3CCR= 	(T3CCR & ~(0x07 << (3*0))) |
			(0x01 << (3*0)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*0));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC30_PIN)
	IC30_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 27 used for tmr3
	VICVectAddr15 = (uint32_t )T3ISR;      		// set interrupt vector in 0
  	VICVectCntl15 = (1<<5) | 27;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<27);						// Enable Timer0 Interrupt. turn on irq4
}

//install user handler for IC1
void tmr3IC1AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t3ic1_ptr = isr_ptr;

	//clear the flag
	T3IR = 1<<5;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T3CTCR = (T3CTCR & ~(0x03 << 2)) | (1 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T3CCR= 	(T3CCR & ~(0x07 << (3*1))) |
			(0x01 << (3*1)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*1));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC31_PIN)
	IC31_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 27 used for tmr3
	VICVectAddr15 = (uint32_t )T3ISR;      		// set interrupt vector in 0
  	VICVectCntl15 = (1<<5) | 27;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<27);						// Enable Timer0 Interrupt. turn on irq4
}

//install user handler for IC2
void tmr3IC2AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t3ic2_ptr = isr_ptr;

	//clear the flag
	T3IR = 1<<6;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T3CTCR = (T3CTCR & ~(0x03 << 2)) | (2 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T3CCR= 	(T3CCR & ~(0x07 << (3*2))) |
			(0x01 << (3*2)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*2));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC32_PIN)
	IC32_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 27 used for tmr3
	VICVectAddr15 = (uint32_t )T3ISR;      		// set interrupt vector in 0
  	VICVectCntl15 = (1<<5) | 27;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<27);						// Enable Timer0 Interrupt. turn on irq4
}

//install user handler for IC3
void tmr3IC3AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t3ic3_ptr = isr_ptr;

	//clear the flag
	T3IR = 1<<7;								//4=IC0, 5=IC1, 6=IC2, 7=IC3
	//timer in timer mode
	//T3CTCR = (T3CTCR & ~(0x03 << 2)) | (3 << 2);//0->use CAPn.0, 1->use CAPn.1, 2->use CAPn.2, 3->use CAPn.3
	//configure capture mode
	//set up the match register. enable interrupt on match
	T3CCR= 	(T3CCR & ~(0x07 << (3*3))) |
			(0x01 << (3*3)) |					//0->disabled, 1->rising edge, 2->falling edge
			(0x04 << (3*0));					//0->disable interrput, 4->enable interrupt

	//configure the capture pin
#if defined(IC33_PIN)
	IC33_PIN();									//route pin to this block
#endif

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 27 used for tmr3
	VICVectAddr15 = (uint32_t )T3ISR;      		// set interrupt vector in 0
  	VICVectCntl15 = (1<<5) | 27;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<27);						// Enable Timer0 Interrupt. turn on irq4
}

//output compare
//set up the match channels
void tmr3OC0SetPR(uint32_t pr) {
	//clear the flag
	T3IR = 1<<0;							//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*0))) |
				(0x00 << (3*0));			//set up the match register. no interrupt yet
	T3MR0= _t3pr0 = pr - 0;

}

//read timer period
uint32_t tmr3OC0GetPR(void) {
	return _t3pr0;
}

//install user handler
void tmr3OC0AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t3mr0_ptr = isr_ptr;

	//clear the flag
	T3IR = 1<<0;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*0))) |
				(0x01 << (3*0));	//set up the match register. interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 27 used for tmr3
	VICVectAddr15 = (uint32_t )T3ISR;      		// set interrupt vector in 0
  	VICVectCntl15 = (1<<5) | 27;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<27);						// Enable Timer0 Interrupt. turn on irq4

