dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
}

//set up the match
void tmr3OC1SetPR(uint32_t pr) {
	//clear the flag
	T3IR = 1<<1;					//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*1))) |
				(0x00 << (3*1));	//set up the match register. no interrupt yet
	T3MR1= _t3pr1 = pr - 0;

}

//read timer period
uint32_t tmr3OC1GetPR(void) {
	return _t3pr1;
}

//install user handler
void tmr3OC1AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t3mr1_ptr = isr_ptr;

	//clear the flag
	T3IR = 1<<1;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*1))) |
				(0x01 << (3*1));	//set up the match register. enable interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 27 used for tmr3
	VICVectAddr15 = (uint32_t )T3ISR;      		// set interrupt vector in 0
  	VICVectCntl15 = (1<<5) | 27;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<27);						// Enable Timer0 Interrupt. turn on irq4
}

//set up the match
void tmr3OC2SetPR(uint32_t pr) {
	//clear the flag
	T3IR = 1<<2;					//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*2))) |
				(0x00 << (3*2));	//set up the match register. no interrupt yet
	T3MR2= _t3pr2 = pr - 0;

}

//read timer period
uint32_t tmr3OC2GetPR(void) {
	return _t3pr2;
}

//install user handler
void tmr3OC2AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t3mr2_ptr = isr_ptr;

	//clear the flag
	T3IR = 1<<2;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*2))) |
				(0x01 << (3*2));	//set up the match register. enable interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 27 used for tmr3
	VICVectAddr15 = (uint32_t )T3ISR;      		// set interrupt vector in 0
  	VICVectCntl15 = (1<<5) | 27;				// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<27);						// Enable Timer1 Interrupt. turn on irq5
}

//set up the match
void tmr3OC3SetPR(uint32_t pr) {
	//clear the flag
	T3IR = 1<<3;					//0=mr0, 1=mr1, 2=mr2, 3=mr3
	//don't enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*3))) |
				(0x00 << (3*3));	//set up the match register. no interrupt yet
	T3MR3= _t3pr3 = pr - 0;

}

//read timer period
uint32_t tmr3OC3GetPR(void) {
	return _t3pr3;
}

//install user handler
void tmr3OC3AttachISR(void (*isr_ptr)(void)) {
	//install user handler
	_t3mr3_ptr = isr_ptr;

	//clear the flag
	T3IR = 1<<3;					//0=MR0, 1=MR1, 2=MR2, 3=MR3
	//enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*3))) |
				(0x01 << (3*3));	//set up the match register. enable interrupt on match

	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 27 used for tmr3
	VICVectAddr15 = (uint32_t )T3ISR;      		// set interrupt vector in 0
  	VICVectCntl15 = (1<<5) | 27;				// use it for Timer 1 Interrupt. irq5 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<27);						// Enable Timer1 Interrupt. turn on irq5
}

//generate pwm output
void tmr3PWM0Init(void) {
	//don't enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*0))) |
				(0x00 << (3*0));				//set up the match register. no interrupt yet
	T3EMR=	(T3EMR & ~(0x03 << 4)) |
			(0x02 << 4);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T3PWMCON=(T3PWMCON &~(1<<0)) | (1<<0);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM30_PIN)
	PWM30_PIN();								//enable the output pin
#endif
}

//generate pwm output
void tmr3PWM1Init(void) {
	//don't enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*1))) |
				(0x00 << (3*1));				//set up the match register. no interrupt yet
	T3EMR=	(T3EMR & ~(0x03 << 6)) |
			(0x02 << 6);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T3PWMCON=(T3PWMCON &~(1<<1)) | (1<<1);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM31_PIN)
	PWM31_PIN();								//enable the output pin
#endif
}

//generate pwm output
void tmr3PWM2Init(void) {
	//don't enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*2))) |
				(0x00 << (3*2));				//set up the match register. no interrupt yet
	T3EMR=	(T3EMR & ~(0x03 << 8)) |
			(0x02 << 8);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T3PWMCON=(T3PWMCON &~(1<<2)) | (1<<2);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM32_PIN)
	PWM32_PIN();								//enable the output pin
#endif
}

//generate pwm output - this resets the pwm period
void tmr3PWM3Init(void) {
	//don't enable interrupt
	T3MCR= 	(T3MCR & ~(0x07 << (3*3))) |
				(0x02 << (3*3));				//set up the match register. 2: reset on match, no interrupt yet
	T3EMR=	(T3EMR & ~(0x03 <<10)) |
			(0x00 <<10);						//0->do nothing, 1->clear on match, 2->set on match, 3->toggle
	T3PWMCON=(T3PWMCON &~(1<<3)) | (1<<3);		//1->enable pwm, 0->disable pwm

	//enable the output pin
#if defined(PWM33_PIN)
	PWM33_PIN();								//enable the output pin
#endif
}
//end timer3
#endif 	//__LPC2103_H

//initialize analog write output
void analogWriteInit(PIN_TypeDef pin) {
	switch (pin) {
		case  P03: tmr0PWMInit(); tmr0PWM0Init(); break;	//mat0.0 on P0.3
		case  P05: tmr0PWMInit(); tmr0PWM1Init(); break;	//mat0.1 on P0.5
		case P016: tmr0PWMInit(); tmr0PWM2Init(); break;	//mat0.2 on P0.16
		//mat0.3 not pinned out
		case P012: tmr1PWMInit(); tmr1PWM0Init(); break;	//mat1.0 on P0.12
		case P013: tmr1PWMInit(); tmr1PWM1Init(); break;	//mat1.1 on P0.13
		case P019: tmr1PWMInit(); tmr1PWM2Init(); break;	//mat1.2 on P0.19
		case P020: tmr1PWMInit(); tmr1PWM3Init(); break;	//mat1.3 on P0.20
		case  P07: tmr2PWMInit(); tmr2PWM0Init(); break;	//mat2.0 on P0.7
		case  P08: tmr2PWMInit(); tmr2PWM1Init(); break;	//mat2.1 on P0.8
		case  P09: tmr2PWMInit(); tmr2PWM2Init(); break;	//mat2.2 on P0.9
		//mat2.3 not pinned out
		case P021: tmr3PWMInit(); tmr3PWM0Init(); break;	//mat3.0 on P0.21
		case  P00: tmr3PWMInit(); tmr3PWM1Init(); break;	//mat3.1 on P0.0
		case  P01: tmr3PWMInit(); tmr3PWM2Init(); break;	//mat3.2 on P0.1
		case P030: tmr3PWMInit(); tmr3PWM3Init(); break;	//mat3.3 on P0.30
	}
}

//arduino style analog output
void analogWrite(PIN_TypeDef pin, uint32_t dc) {
	switch (pin) {
		case  P03: tmr0PWM0SetDC(dc); break;	//mat0.0 on P0.3
		case  P05: tmr0PWM1SetDC(dc); break;	//mat0.1 on P0.5
		case P016: tmr0PWM2SetDC(dc); break;	//mat0.2 on P0.16
		//mat0.3 not pinned out
		case P012: tmr1PWM0SetDC(dc); break;	//mat1.0 on P0.12
		case P013: tmr1PWM1SetDC(dc); break;	//mat1.1 on P0.13
		case P019: tmr1PWM2SetDC(dc); break;	//mat1.2 on P0.19
		case P020: tmr1PWM3SetDC(dc); break;	//mat1.3 on P0.20
		case  P07: tmr2PWM0SetDC(dc); break;	//mat2.0 on P0.7
		case  P08: tmr2PWM1SetDC(dc); break;	//mat2.1 on P0.8
		case  P09: tmr2PWM2SetDC(dc); break;	//mat2.2 on P0.9
		//mat2.3 not pinned out
		case P021: tmr3PWM0SetDC(dc); break;	//mat3.0 on P0.21
		case  P00: tmr3PWM1SetDC(dc); break;	//mat3.1 on P0.0
		case  P01: tmr3PWM2SetDC(dc); break;	//mat3.2 on P0.1
		case P030: tmr3PWM3SetDC(dc); break;	//mat3.3 on P0.30
	}
}

//uart0
//uart0 tx isr
void u0tx_isr(void) {
	
	//ux transmit isr
	//'\0' is now transmitted
	//void _ISR _U1TXInterrupt(void) {
	//char tmp;
	//TX only, RX not implemented
	//IFS1bits.U1TXIF = 0;				//UxTXIF = 0;							//clear the flag
	if (*_U0TX_ptr) {					//0 indicates the end of the string
		//_UxTX_ptr;					//increment to the next char
		//tmp = *_UxTX_ptr++; UxTXREG = tmp;
		U0THR = *_U0TX_ptr++;			//load up a char to be transmitted
		//NOP();
		//IFS1bits.U1TXIF = 0;			//UxTXIF = 0;						//clear the flag
	} else {
		//UxSTA.UTXEN = 0;				//turn off the transmission
		//VICIntEnClr = 1<<6;			//IEC1bits.U1TXIE = 0;			//UxTXIE = 0;						//disable the interrupt
		U0IER &=~(1<<1);				//disable the thre interrupt
		//_U1TX_BUSY = 0;				//transmission done
	}
}

//initialize usart: high baudrate (brgh=1), 16-bit baudrate (brg16=1)
//baudrate=Fxtal/(4*(spbrg+1))
//spbrg=(Fxtal/4/baudrate)-1
//tx/rx pins to be assumed in gpio mode
//data bits: 	8
//parity: 		none
//stop bits: 	1
//Xon/Xoff:		none
void uart0Init(uint32_t bps) {
	uint32_t DLL, DIV, MUL, baudrate; int32_t error;						//uart parameters + error rate, x 100, for integer dividers
	uint32_t DLL_f, DIV_f, MUL_f, baudrate_f; int32_t error_f;				//uart parameters + error rate, x 100, for fractional dividers
	uint32_t /*DLL_f1, */DIV_f1, MUL_f1, baudrate_f1; int32_t error_f1;			//uart parameters + error rate, x 100, for fractional dividers

	PCONP |= 1<<3;				//enable clock: 3: uart0, 4: uart1

	//configure the pins
    // Change P0.2/TXD0 and P0.3/RXD0 mode '0b01'
	//LPC_PINCON->PINSEL0 = (LPC_PINCON->PINSEL0 &~(0b11 << 4)) | (0b01 << 4);	//'0b01'->P0.2 to TXD0
	//LPC_PINCON->PINSEL0 = (LPC_PINCON->PINSEL0 &~(0b11 << 6)) | (0b01 << 6);	//'0b01'->P0.3 to RXD0
#if defined(U0TX_PIN)
	U0TX_PIN();					//enable TX pin output
#endif

#if defined(U0RX_PIN)
	U0RX_PIN();				  	//enable RX pin input
#endif

	//enable power to uart
	//LPC_SC->PCONP |= (1<<3);							//3=uart0, 4=uart1, 24=uart2, 25=uart3
	//LPC_SC->PCLKSEL0 = (LPC_SC->PCLKSEL0 &~(0b11<<6)) | (0b00 << 6);	//PCLKSEL0: 6=uart0, 8=uart1. 0b00=4:1,0b01=1:1, 0b10=2:1, 0b11=8:1
	//LPC_SC->PCLKSEL1 = (LPC_SC->PCLKSEL1 &~(0b11<<16)) | (0b00 << 16);	//PCLKSEL1: 16=uart2, 18=uart3. 0b00=4:1,0b01=1:1, 0b10=2:1, 0b11=8:1

	//find out F_UART
	//switch ((LPC_SC->PCLKSEL0 >> 6) & 0b11) {
	//case 0b00: F_UART = F_CPU / 4; break;
	//case 0b01: F_UART = F_CPU / 1; break;
	//case 0b10: F_UART = F_CPU / 2; break;
	//case 0b11: F_UART = F_CPU / 8; break;
	//}

    //calculate error rate for integer dividers
	DLL = F_UART / 16 / bps;						//divider, 16-bits
	DIV = 0; MUL = 1;								//set div/mul
	baudrate = F_UART / 16 * 100 / DLL / (MUL +  DIV) * MUL;	//baud rate, x100
	error = bps * 100 - baudrate;					//error, x100
	if (error < 0) error = - error;					//only compare positive numbers

	//calculate error rate for fractional dividers
	DLL_f = F_UART / 16 / bps * 10 / 15;			//estimate divider to 1.5x
	DIV_f = 0; MUL_f = 1;							//set div/mul
	baudrate_f = F_UART / 16 * 100 / DLL_f / (MUL_f + DIV_f) * MUL_f;	//baud rate, x100
	error_f = bps * 100 - baudrate_f;				//error, x100
	if (error_f < 0) error_f = -error_f;			//only compare positive numbers

	for (MUL_f1 = 2; MUL_f1 < 16; MUL_f1 ++ ) {		//MUL_f = [1..15]
		for (DIV_f1 = 0; DIV_f1 < MUL_f1; DIV_f1++) {		//DIV_f = [0..MUL_f-1]
			baudrate_f1 = F_UART / 16 * 100 / DLL_f / (MUL_f1 + DIV_f1) * MUL_f1;	//baud rate, x100
			error_f1 = bps * 100 - baudrate_f1;		//error, x100
			if (error_f1 < 0) error_f1 = -error_f1;	//only compare positive numbers
			//save the optimal dividers for fractional dividers
			if (error_f1 < error_f) {DIV_f = DIV_f1; MUL_f = MUL_f1; error_f = error_f1;}
		}
	}

	//now compare integer dividers vs. the optimal fractional dividers and find the best settings
	if (error_f < error) {DLL = DLL_f; DIV = DIV_f; MUL = MUL_f;}

	//now, DLL, DIV and MUL contain the best settings

	//now set up the uart: 8 data bits, 1 stop bit, no parity
	U0IER = 0;									//disable all interrupts
	U0TER = 0;									//0->disable transmission
	U0ACR = 0;									//disable auto baud rate
	U0LCR = (0x03<<0) |						//'0b11'->8-bit data
			(0<<2) |						//'0'->1stop bit, '1'->2 stop bits
			(0<<3) |						//'0'->disable parity
			(0x00<<4) |						//'0b00'->odd parity
			(0<<6) |						//'0'->disable break transmission
			(1<<7) |						//'1'->enable access to divisor latch, 0->disable access
			0x00;
	U0FDR = (DIV & 0x0f) |					//divider
			((MUL & 0x0f) << 4) |			//multiplier
			0x00;
	U0DLL = 	(DLL & 0xff);					//DLL's lsb
	U0DLM = 	(DLL >> 8) & 0xff;				//DLL's msb
	U0LCR&=~(1<<7);							//disable divisor latch by clearing bit 7
	U0FCR = 	(1<<0) |						//'1'->enable fifo
				(1<<1) |						//'1'->reset rx fifo - self-clearing
				(1<<2) |						//'1'->reset tx fifo - self-clearing
				(0<<3) |						//'0'->disable DMA
				(0x00<<6) |						//'0b00'->dma trigger level 0
				0x00;
	U0TER = (1<<7);								//enable transmission

#if defined(USE_U0TXISR)
	U0IIR;								//clear the flag by reading it
	U0IER &=~(1<<1);					//1->enable tx interrupt, 0->disable tx interrupt
	//enable non-vectored irq -> no priority etc.
	//VICDefVectAddr = (uint32_t )DefISR; // set interrupt vector in DefISR
	//VICVectCntl5 = (1<<5) | 5;		// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
	VICIntEnable = (1<<6);				// Enable uart0 Interrupt. 6 for uart0, 7 for uart1
	//IEC1bits.U1TXIE = 1;				//UxTXIE = 1;							//enable the interrupt
#endif

