dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
}

void uart0Putch(char ch) {
	while (uart0Busy()) continue;				//wait for transmission to free up
	U0THR = ch;									//start transmission
}

//put a string
void uart0Puts(char *str) {
#if defined(USE_U0TXISR)
	//interrupt transmission
	if (*str) {								//if the string isn't empty to begin with
		uart0Wait();						//for compatability with polling transmission
		//U1TXREG = 0;						//clear the buffer
		//_U1TX_BUSY  = 1;					//transmission in progress
		_U0TX_ptr=str;						//point to the string to be transmitted
		U0IIR;								//read U0IIR to clear the flag	IFS1bits.U1TXIF = 0;				//UxTXIF = 0;							//clear the flag
		//U1STAbits.UTXEN = 1;				//enable transmission - always enabled
		//tmp = *_UxTX_ptr++;	UxTXREG = tmp;						//*_UxTX_ptr++;				//load up the 1st char. advance to the next char
		U0THR = *_U0TX_ptr++;				//send the first char
		//enable non-vectored irq -> no priority etc.
		//VICDefVectAddr = (uint32_t )DefISR; // set interrupt vector in DefISR
	  	//VICVectCntl5 = (1<<5) | 5;		// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
	  	//VICIntEnable = (1<<6);			// Enable uart0 Interrupt.
		//IEC1bits.U1TXIE = 1;				//UxTXIE = 1;							//enable the interrupt
		U0IER |= 1<<1;						//1->enable tx interrupt, 0->disable tx interrupt
	}
	
#else
	while (*str) uart0Putch(*str++);
#endif
}

/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

//put a line termined with ln
void uart0Putline(char *ln) {
	//USARTWriteString(ln);
	uart0Puts(ln);
	//USARTWriteString("\r\n");
	uart0Puts((char *)"\r\n");
}

//get the received char
//uint8_t uartGetch(void) {
//	    return LPC_UART0->RBR;                       	//save the transmission buffer
//}

//test if data rx is available
//uint16_t uartAvailable(void) {
//	return LPC_UART0->LSR & (1<<0);						//'1'->the receiver has an unread char
//}

//test if uart tx is busy
//uint16_t uartBusy(void) {
//	return ~LPC_UART0->LSR & (1<<5);					//'1'@5 -> transmission buffer empty. '1'@6->transmission complete
//}

//print to uart1
void u0Print(char *str, int32_t dat) {
	static char uRAM[uRAM_SIZE];						//transmission buffer, 40-1 char max

	uart0Wait();										//wait for prior transmission to end
	strcpy(uRAM, str);					//copy to uarm
	if (dat < 0) {uRAM[6]='-'; dat = -dat;}
	uRAM[19]='0'+(dat % 10); dat /= 10;
	uRAM[18]='0'+(dat % 10); dat /= 10;
	uRAM[17]='0'+(dat % 10); dat /= 10;
	uRAM[16]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[15]='0'+(dat % 10); dat /= 10;
	uRAM[14]='0'+(dat % 10); dat /= 10;
	uRAM[13]='0'+(dat % 10); dat /= 10;
	uRAM[12]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[11]='0'+(dat % 10); dat /= 10;
	uRAM[10]='0'+(dat % 10); dat /= 10;
	uRAM[ 9]='0'+(dat % 10); dat /= 10;
	uRAM[ 8]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[ 7]='0'+(dat % 10); dat /= 10;
	uart0Puts(uRAM);	//send a message on uart1
}

//uart1
//uart1 tx isr
void u1tx_isr(void) {
	
	//ux transmit isr
	//'\0' is now transmitted
	//void _ISR _U1TXInterrupt(void) {
	//char tmp;
	//TX only, RX not implemented
	//IFS1bits.U1TXIF = 0;				//UxTXIF = 0;							//clear the flag
	if (*_U1TX_ptr) {					//0 indicates the end of the string
		//_UxTX_ptr;					//increment to the next char
		//tmp = *_UxTX_ptr++; UxTXREG = tmp;
		U1THR = *_U1TX_ptr++;			//load up a char to be transmitted
		//NOP();
		//IFS1bits.U1TXIF = 0;			//UxTXIF = 0;						//clear the flag
	} else {
		//UxSTA.UTXEN = 0;				//turn off the transmission
		//VICIntEnClr = 1<<6;			//IEC1bits.U1TXIE = 0;			//UxTXIE = 0;						//disable the interrupt
		U1IER &=~(1<<1);				//disable the thre interrupt
		//_U1TX_BUSY = 0;				//transmission done
	}
}

//initialize usart: high baudrate (brgh=1), 16-bit baudrate (brg16=1)
//baudrate=Fxtal/(4*(spbrg+1))
//spbrg=(Fxtal/4/baudrate)-1
//tx/rx pins to be assumed in gpio mode
//data bits: 	8
//parity: 		none
//stop bits: 	1
//Xon/Xoff:		none
void uart1Init(uint32_t bps) {
	uint32_t DLL, DIV, MUL, baudrate; int32_t error;						//uart parameters + error rate, x 100, for integer dividers
	uint32_t DLL_f, DIV_f, MUL_f, baudrate_f; int32_t error_f;				//uart parameters + error rate, x 100, for fractional dividers
	uint32_t /*DLL_f1, */DIV_f1, MUL_f1, baudrate_f1; int32_t error_f1;			//uart parameters + error rate, x 100, for fractional dividers

	PCONP |= 1<<4;				//enable clock: 3: uart0, 4: uart1

	//configure the pins
    // Change P0.2/TXD0 and P0.3/RXD0 mode '0b01'
	//LPC_PINCON->PINSEL0 = (LPC_PINCON->PINSEL0 &~(0b11 << 4)) | (0b01 << 4);	//'0b01'->P0.2 to TXD0
	//LPC_PINCON->PINSEL0 = (LPC_PINCON->PINSEL0 &~(0b11 << 6)) | (0b01 << 6);	//'0b01'->P0.3 to RXD0
#if defined(U1TX_PIN)
	U1TX_PIN();					//enable TX pin output
#endif

#if defined(U1RX_PIN)
	U1RX_PIN();				  	//enable RX pin input
#endif

	//enable power to uart
	//LPC_SC->PCONP |= (1<<3);							//3=uart0, 4=uart1, 24=uart2, 25=uart3
	//LPC_SC->PCLKSEL0 = (LPC_SC->PCLKSEL0 &~(0b11<<6)) | (0b00 << 6);	//PCLKSEL0: 6=uart0, 8=uart1. 0b00=4:1,0b01=1:1, 0b10=2:1, 0b11=8:1
	//LPC_SC->PCLKSEL1 = (LPC_SC->PCLKSEL1 &~(0b11<<16)) | (0b00 << 16);	//PCLKSEL1: 16=uart2, 18=uart3. 0b00=4:1,0b01=1:1, 0b10=2:1, 0b11=8:1

	//find out F_UART
	//switch ((LPC_SC->PCLKSEL0 >> 6) & 0b11) {
	//case 0b00: F_UART = F_CPU / 4; break;
	//case 0b01: F_UART = F_CPU / 1; break;
	//case 0b10: F_UART = F_CPU / 2; break;
	//case 0b11: F_UART = F_CPU / 8; break;
	//}

    //calculate error rate for integer dividers
	DLL = F_UART / 16 / bps;						//divider, 16-bits
	DIV = 0; MUL = 1;								//set div/mul
	baudrate = F_UART / 16 * 100 / DLL / (MUL +  DIV) * MUL;	//baud rate, x100
	error = bps * 100 - baudrate;					//error, x100
	if (error < 0) error = - error;					//only compare positive numbers

	//calculate error rate for fractional dividers
	DLL_f = F_UART / 16 / bps * 10 / 15;			//estimate divider to 1.5x
	DIV_f = 0; MUL_f = 1;							//set div/mul
	baudrate_f = F_UART / 16 * 100 / DLL_f / (MUL_f + DIV_f) * MUL_f;	//baud rate, x100
	error_f = bps * 100 - baudrate_f;				//error, x100
	if (error_f < 0) error_f = -error_f;			//only compare positive numbers

	for (MUL_f1 = 2; MUL_f1 < 16; MUL_f1 ++ ) {		//MUL_f = [1..15]
		for (DIV_f1 = 0; DIV_f1 < MUL_f1; DIV_f1++) {		//DIV_f = [0..MUL_f-1]
			baudrate_f1 = F_UART / 16 * 100 / DLL_f / (MUL_f1 + DIV_f1) * MUL_f1;	//baud rate, x100
			error_f1 = bps * 100 - baudrate_f1;		//error, x100
			if (error_f1 < 0) error_f1 = -error_f1;	//only compare positive numbers
			//save the optimal dividers for fractional dividers
			if (error_f1 < error_f) {DIV_f = DIV_f1; MUL_f = MUL_f1; error_f = error_f1;}
		}
	}

	//now compare integer dividers vs. the optimal fractional dividers and find the best settings
	if (error_f < error) {DLL = DLL_f; DIV = DIV_f; MUL = MUL_f;}

	//now, DLL, DIV and MUL contain the best settings

	//now set up the uart: 8 data bits, 1 stop bit, no parity
	U1IER = 0;									//disable all interrupts
	U1TER = 0;									//0->disable transmission
	U1ACR = 0;									//disable auto baud rate
	U1LCR = (0x03<<0) |						//'0b11'->8-bit data
			(0<<2) |						//'0'->1stop bit, '1'->2 stop bits
			(0<<3) |						//'0'->disable parity
			(0x00<<4) |						//'0b00'->odd parity
			(0<<6) |						//'0'->disable break transmission
			(1<<7) |						//'1'->enable access to divisor latch
			0x00;
	U1FDR = (DIV & 0x0f) |						//divider
			((MUL & 0x0f) << 4) |				//multiplier
			0x00;
	U1DLL = 	(DLL & 0xff);					//DLL's lsb
	U1DLM = 	(DLL >> 8) & 0xff;				//DLL's msb
	U1LCR&=~(1<<7);								//disable divisor latch by clearing bit 7
	U1FCR = 	(1<<0) |						//'1'->enable fifo
				(1<<1) |						//'1'->reset rx fifo - self-clearing
				(1<<2) |						//'1'->reset tx fifo - self-clearing
				(0<<3) |						//'0'->disable DMA
				(0x00<<6) |						//'0b00'->dma trigger level 0
				0x00;
	U1TER = (1<<7);								//enable transmission

#if defined(USE_U1TXISR)
	U1IIR;								//clear the flag by reading it
	U1IER &=~(1<<1);					//1->enable tx interrupt, 0->disable tx interrupt
	//enable non-vectored irq -> no priority etc.
	//VICDefVectAddr = (uint32_t )DefISR; // set interrupt vector in DefISR
	//VICVectCntl5 = (1<<5) | 5;		// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
	VICIntEnable = (1<<7);				// Enable uart0 Interrupt. 6 for uart0, 7 for uart1
	//IEC1bits.U1TXIE = 1;				//UxTXIE = 1;							//enable the interrupt
#endif

