dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
}

void uart1Putch(char ch) {
	while (uart1Busy()) continue;				//wait for transmission to free up
	U1THR = ch;									//start transmission
}

//put a string
void uart1Puts(char *str) {
#if defined(USE_U1TXISR)
	//interrupt transmission
	if (*str) {								//if the string isn't empty to begin with
		uart1Wait();						//for compatability with polling transmission
		//U1TXREG = 0;						//clear the buffer
		//_U1TX_BUSY  = 1;					//transmission in progress
		_U1TX_ptr=str;						//point to the string to be transmitted
		U1IIR;								//read U0IIR to clear the flag	IFS1bits.U1TXIF = 0;				//UxTXIF = 0;							//clear the flag
		//U1STAbits.UTXEN = 1;				//enable transmission - always enabled
		//tmp = *_UxTX_ptr++;	UxTXREG = tmp;						//*_UxTX_ptr++;				//load up the 1st char. advance to the next char
		U1THR = *_U1TX_ptr++;				//send the first char
		//enable non-vectored irq -> no priority etc.
		//VICDefVectAddr = (uint32_t )DefISR; // set interrupt vector in DefISR
	  	//VICVectCntl5 = (1<<5) | 5;		// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
	  	//VICIntEnable = (1<<6);			// Enable uart0 Interrupt.
		//IEC1bits.U1TXIE = 1;				//UxTXIE = 1;							//enable the interrupt
		U1IER |= 1<<1;						//1->enable tx interrupt, 0->disable tx interrupt
	}
	
#else
	while (*str) uart1Putch(*str++);
#endif
}

/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

//put a line termined with ln
void uart1Putline(char *ln) {
	//USARTWriteString(ln);
	uart1Puts(ln);
	//USARTWriteString("\r\n");
	uart1Puts((char *)"\r\n");
}

//get the received char
//uint8_t uartGetch(void) {
//	    return LPC_UART0->RBR;                       	//save the transmission buffer
//}

//test if data rx is available
//uint16_t uartAvailable(void) {
//	return LPC_UART0->LSR & (1<<0);						//'1'->the receiver has an unread char
//}

//test if uart tx is busy
//uint16_t uartBusy(void) {
//	return ~LPC_UART0->LSR & (1<<5);					//'1'@5 -> transmission buffer empty. '1'@6->transmission complete
//}

//print to uart1
void u1Print(char *str, int32_t dat) {
	static char uRAM[uRAM_SIZE];						//transmission buffer, 40-1 char max

	uart1Wait();										//wait for prior transmission to end
	strcpy(uRAM, str);					//copy to uarm
	if (dat < 0) {uRAM[6]='-'; dat = -dat;}
	uRAM[19]='0'+(dat % 10); dat /= 10;
	uRAM[18]='0'+(dat % 10); dat /= 10;
	uRAM[17]='0'+(dat % 10); dat /= 10;
	uRAM[16]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[15]='0'+(dat % 10); dat /= 10;
	uRAM[14]='0'+(dat % 10); dat /= 10;
	uRAM[13]='0'+(dat % 10); dat /= 10;
	uRAM[12]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[11]='0'+(dat % 10); dat /= 10;
	uRAM[10]='0'+(dat % 10); dat /= 10;
	uRAM[ 9]='0'+(dat % 10); dat /= 10;
	uRAM[ 8]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[ 7]='0'+(dat % 10); dat /= 10;
	uart1Puts(uRAM);	//send a message on uart1
}

//end Serial

//exint0..2
//pointer to user handler
static void (* _eint0_ptr)(void)=empty_handler;				//eint0 pointing to empty_handler
static void (* _eint1_ptr)(void)=empty_handler;				//eint1 pointing to empty_handler
static void (* _eint2_ptr)(void)=empty_handler;				//eint2 pointing to empty_handler
//static void (* _eint3_ptr)(void)=empty_handler;				//eint3 pointing to empty_handler

//vector's isr for eint0
void __irq EINT0ISR(void) {
	EXTINT |= (1<<0);					//1->clear the flag
	_eint0_ptr();						//execute the usr isr
}

//initialize int0
//always edge sensitive
//pol = RISING -> rising edge
//pol = FALLING-> falling
void int0Init(int pol) {
	//eint0 at 14, eint1 at 15, eint2 at 16
	VICIntEnClr = 1<<14;				//disable the interrupt
	EXTMODE = 	(EXTMODE & ~(0x01 << 0)) |	//clear the bits
				(1 << 0);					//0->level sensitive, 1->edge sensitive
	EXTPOLAR=	(EXTPOLAR& ~(0x01 << 0)) |	//clear the bit
				(((pol==RISING)?1:0) << 0);	//0->falling edge, !0->rising edge
	//enable the pin
#if defined(INT0_PIN)
	INT0_PIN();								//enable INT0 pin
#endif
}

//install user isr
void int0AttachISR(void (* isr_ptr)(void)) {
	_eint0_ptr = isr_ptr;				//install the user isr
	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 11 used for eint0, 12 for eint1, 13 for eint2
	VICVectAddr11 = (uint32_t )EINT0ISR;      		// set interrupt vector in 0
  	VICVectCntl11 = (1<<5) | 14;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<14);							// Enable Timer0 Interrupt. turn on irq4

}

//vector's isr for eint1
void __irq EINT1ISR(void) {
	EXTINT |= (1<<1);					//1->clear the flag
	_eint1_ptr();						//execute the usr isr
}

//always edge sensitive
//pol = 1-> rising edge
//pol = 0-> falling
void int1Init(int pol) {
	//eint0 at 14, eint1 at 15, eint2 at 16
	VICIntEnClr = 1<<15;						//disable the interrupt
	EXTMODE = 	(EXTMODE & ~(0x01 << 1)) |		//clear the bits
				(1 << 1);					//0->level sensitive, 1->edge sensitive
	EXTPOLAR=	(EXTPOLAR& ~(0x01 << 1)) |	//clear the bit
				(((pol==RISING)?1:0) << 1);	//0->falling edge, !0->rising edge
	//enable the pin
#if defined(INT1_PIN)
	INT1_PIN();								//enable INT1 pin
#endif
}

//install user isr
void int1AttachISR(void (* isr_ptr)(void)) {
	_eint1_ptr = isr_ptr;						//install the user isr
	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 11 used for eint0, 12 for eint1, 13 for eint2
	VICVectAddr12 = (uint32_t )EINT1ISR;      		// set interrupt vector in 0
  	VICVectCntl12 = (1<<5) | 15;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<15);							// Enable Timer0 Interrupt. turn on irq4

}

//vector's isr for eint2
void __irq EINT2ISR(void) {
	EXTINT |= (1<<4);					//1->clear the flag
	_eint2_ptr();						//execute the usr isr
}

//always edge sensitive
//pol = 1-> rising edge
//pol = 0-> falling
void int2Init(int pol) {
	//eint0 at 14, eint1 at 15, eint2 at 16
	VICIntEnClr = 1<<16;						//disable the interrupt
	EXTMODE = 	(EXTMODE & ~(0x01 << 2)) |		//clear the bits
				(1 << 2);				//0->level sensitive, 1->edge sensitive
	EXTPOLAR=	(EXTPOLAR& ~(0x01 << 2)) |	//clear the bit
				(((pol==RISING)?1:0) << 2);	//0->falling edge, !0->rising edge
	//enable the pin
#if defined(INT2_PIN)
	INT2_PIN();								//enable INT2 pin
#endif
}

