dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
//install user isr
void int2AttachISR(void (* isr_ptr)(void)) {
	_eint2_ptr = isr_ptr;						//install the user isr
	//enable irq -> no priority etc.
	//NVIC_EnableIRQ(CTx_IRQn);
	//vector 11 used for eint0, 12 for eint1, 13 for eint2
	VICVectAddr13 = (uint32_t )EINT2ISR;      		// set interrupt vector in 0
  	VICVectCntl13 = (1<<5) | 16;					// use it for Timer 0 Interrupt. irq4 + enable bits (0x20, bit 5)
  	VICIntEnable = (1<<16);							// Enable Timer0 Interrupt. turn on irq4

}


//end exint0..2

//analog initialized
void adcInit(void) {
	PCONP |= 1<<12;									//1->enable clock to adc, 0->disable clock to adc

	ADCR =	(0<<0) |								//select adc channels: 1<<0->AD0, 1<<7->AD7. only one bit can be set
			//(((F_PHB/4500000ul)?(F_PHB / 4500000ul):1)<<8)| //clock divider, F_ADC < 4.5Mhz. clock divider is at least 1
			((F_PHB / 4500000ul)<<8)| 				//clock divider, F_ADC < 4.5Mhz. clock divider can be 0x00
			(0<<16) |								//1->repeat conversions, 0->burst conversion
			(0<<17) |								//0->11 clocks/10 bits, 1->10 clocks/9 bits...
			(1<<21) |								//1->adc module operational, 0->adc module powered down
			(0<<24) |								//1->start adc, 0->not start adc
			(0<<27) |								//not used unless bit 24..26 is 010-111
			0x00;
	//ADGDR -> not used
	ADINTEN = 0;									//0->interrupt disabled
}

//read an analog channel
uint16_t adcRead(uint8_t ch) {
	uint32_t tmp=0;

	switch (ch) {
		case ADC_CH0: PINSEL1 = (PINSEL1 &~(0x03 << 12)) | (0x03 << 12); ADCR = (ADCR &~(0x7f << 0)) | (ch << 0) | (1<<24); while ((ADGDR & (1ul<<31)) == 0) continue; tmp = ADDR0; break;	//ad0.0 on P0.22
		case ADC_CH1: PINSEL1 = (PINSEL1 &~(0x03 << 14)) | (0x03 << 14); ADCR = (ADCR &~(0x7f << 0)) | (ch << 0) | (1<<24); while ((ADGDR & (1ul<<31)) == 0) continue; tmp = ADDR1; break;	//ad0.1 on P0.23
		case ADC_CH2: PINSEL1 = (PINSEL1 &~(0x03 << 16)) | (0x03 << 16); ADCR = (ADCR &~(0x7f << 0)) | (ch << 0) | (1<<24); while ((ADGDR & (1ul<<31)) == 0) continue; tmp = ADDR2; break;	//ad0.2 on P0.24
		case ADC_CH3: PINSEL0 = (PINSEL0 &~(0x03 << 20)) | (0x03 << 20); ADCR = (ADCR &~(0x7f << 0)) | (ch << 0) | (1<<24); while ((ADGDR & (1ul<<31)) == 0) continue; tmp = ADDR3; break;	//ad0.3 on P0.10
		case ADC_CH4: PINSEL0 = (PINSEL0 &~(0x03 << 22)) | (0x03 << 22); ADCR = (ADCR &~(0x7f << 0)) | (ch << 0) | (1<<24); while ((ADGDR & (1ul<<31)) == 0) continue; tmp = ADDR4; break;	//ad0.4 on P0.11
		case ADC_CH5: PINSEL0 = (PINSEL0 &~(0x03 << 24)) | (0x03 << 24); ADCR = (ADCR &~(0x7f << 0)) | (ch << 0) | (1<<24); while ((ADGDR & (1ul<<31)) == 0) continue; tmp = ADDR5; break;	//ad0.5 on P0.12
		case ADC_CH6: PINSEL1 = (PINSEL1 &~(0x03 << 18)) | (0x03 << 18); ADCR = (ADCR &~(0x7f << 0)) | (ch << 0) | (1<<24); while ((ADGDR & (1ul<<31)) == 0) continue; tmp = ADDR6; break;	//ad0.6 on P0.25
		case ADC_CH7: PINSEL1 = (PINSEL1 &~(0x03 << 20)) | (0x03 << 20); ADCR = (ADCR &~(0x7f << 0)) | (ch << 0) | (1<<24); while ((ADGDR & (1ul<<31)) == 0) continue; tmp = ADDR7; break;	//ad0.7 on P0.26
	}
	return (tmp >> 6) & 0x3ff;
}

//read analog, arduino style
uint16_t analogRead(PIN_TypeDef pin) {
	uint32_t tmp=0;
	switch (pin) {
		case P022: tmp = adcRead(ADC_CH0); break;	//ad0.0 on P0.22
		case P023: tmp = adcRead(ADC_CH1); break;	//ad0.1 on P0.23
		case P024: tmp = adcRead(ADC_CH2); break;	//ad0.2 on P0.24
		case P010: tmp = adcRead(ADC_CH3); break;	//ad0.3 on P0.10
		case P011: tmp = adcRead(ADC_CH4); break;	//ad0.4 on P0.11
		case P012: tmp = adcRead(ADC_CH5); break;	//ad0.5 on P0.12
		case P025: tmp = adcRead(ADC_CH6); break;	//ad0.6 on P0.25
		case P026: tmp = adcRead(ADC_CH7); break;	//ad0.7 on P0.26
	}

	return tmp;
}

//end adc

//spi
//initialize spi
void spi0Init(void) {
	PCONP |= 1<<8;					//spi0: bit 8, spi1/ssp: bit 10

	S0SPCR =	(0<<2) |			//0->8bit mode, 1-> see bit 8..11
				(0<<3) |			//cpha: 0->sampled on 1st clock edge, 1->on 2nd clock edge
				(0<<4) |			//cpol: 0->sck active high, 1->active low
				(1<<5) |			//1->master mode, 0->slave mode)
				(0<<6) |			//0->msb first, 1->lsb first
				(0<<7) |			//0->disable interrupt, 1->enable interrupt
				(8<<8) |			//number of bits each transfer. 8=8bits, ...15=15 bits, 0=16bits
				0x00;
	S0SPSR = 0;						//clear the flag
	S0SPCCR = (F_PHB / F_SPI0 < 8)?8:(F_PHB / F_SPI0);	//must be at least 8
	S0SPCCR&=~(1<<0);				//must be en even number->last bit is 0
	if (S0SPCCR > 255) S0SPCCR = 255;	//this is an 8-bit number

//enable the pins
#if defined(SCLK0_PIN)			//serial clock
	SCLK0_PIN();
#endif

#if defined(SSEL0_PIN)	   		//slave select, active low
	SSEL0_PIN();
#endif

#if defined(MISO0_PIN)	 		//master in, slave out
	MISO0_PIN();
#endif

#if defined(MOSI0_PIN)			//mast out, slave in
	MOSI0_PIN();
#endif

}

uint8_t spi0Write(uint8_t dat) {
	S0SPDR = dat;				//load the data
	while (spi0Busy()) continue;	//wait for the transmission to end

	return S0SPDR;
}

//end spi

//ssp/spi1
//initialize ssp as spi1
void spi1Init(void) {
	PCONP |= 1<<10;					//spi0: bit 8, spi1/ssp: bit 10

	SSPCPSR= 	(F_PHB / F_SPI1 < 2)?2:(F_PHB / F_SPI1);	//cpsr is at least 2
	SSPCR0 =	(7<<0) |			//data transfer size. 3=4bit, 7=8bit, 15=16bit
				(0<<4) |			//framing: 0->spi, 1->ssp, 2->microwire, 3->don't use
				(0<<6) |			//cpol: 0->sck active high, 1->active low
				(0<<7) |			//cpha: 0->sampled on 1st clock edge, 1->on 2nd clock edge
				((F_PHB / SSPCPSR / F_SPI1) <<8) |			//serial clock rate
				0x00;
	SSPCR1 =	(0<<0) |			//0->normal opeartion, 1-> loop back
				(0<<1) |			//0->disable ssp, 1->enable ssp
				(0<<2) |			//0->master mode, 1->slave mode
				(0<<3) |			//0->doesn't block the ssp module, 1->block the ssp module - only meaningful as slave
				0x00;
	SSPSR = 0;						//clear the flag

//enable the pins
#if defined(SCLK1_PIN)			//serial clock
	SCLK1_PIN();
#endif

#if defined(SSEL1_PIN)	   		//slave select, active low
	SSEL1_PIN();
#endif

#if defined(MISO1_PIN)	 		//master in, slave out
	MISO1_PIN();
#endif

