dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
#if defined(MOSI1_PIN)			//mast out, slave in
	MOSI1_PIN();
#endif

}

uint8_t spi1Write(uint8_t dat) {
	SSPDR = dat;				//load the data
	while (spi1Busy()) continue;	//wait for the transmission to end

	return SSPDR;
}

//end ssp/spi1

//rtc on low speed crystal
void rtcInit(void) {
	PCONP |= 1<<9;					//1->enable clock to RTC

	//enable the rtc clock
	CCR =	(1<<0) |				//1->enable rtc
			(0<<1) |				//1->reset the rtc
			(1<<4) |				//0->clock from the prescaler, 1-> from low speed crystal
			0x00;
	//rtc now running
}

//configure rtc to use pclk
void rtcInit2PCLK(void) {
	PCONP |= 1<<9;					//1->enable clock to RTC

	//calculate the prescaler
	PREINT = F_PHB / 32768 - 1;
	PREFRAC= F_PHB - (PREINT + 1) * 32768;

	//enable the rtc clock
	CCR =	(1<<0) |				//1->enable rtc
			(0<<1) |				//1->reset the rtc
			(0<<4) |				//0->clock from the prescaler, 1-> from low speed crystal
			0x00;
	//rtc now running
}

//end rtc

//i2c

#define I2C_ACK					0					//0->ack, per i2c protocol
#define I2C_NOACK				1					//1->no ack, per i2c protocol

//initialize i2c0
//master mode only
void i2c0Init(void) {
	uint16_t div;

	PCONP |= 1<<7;					//1->enable clock. 7: i2c0, 19: i2c1

	I2C0CONCLR = 	(1<<2) |		//0->clear ack flag
					(1<<3) |		//0->clear the interrupt flag
					(1<<4) |		//0->send a stop condition
					(1<<6) |		//0->disable the i2c module
					0x00;
	
	//calculate the diver
#if 0								//a simple implementation
	div = F_PHB / F_I2C0 / 2;		//calculate the divider, 16-bit
	if (div < 4) div = 4;			//divider at least 4
	I2C0SCLH = I2C0SCLL = div; 		//equal value for SCLH/SCLL
#else								//a more accurate implementation (70 bytes more in flash :))
	div = (F_PHB + F_I2C0/2) / F_I2C0;	//rounding up
	I2C0SCLH = div/2; if (I2C0SCLH < 4) I2C0SCLH = 4;
	I2C0SCLL = div - I2C0SCLH; if (I2C0SCLL < 4) I2C0SCLL = 4;
#endif

	//I2C0STAT = 0;						//clear the flag - read only

	//configure the pins
	PINSEL0 = (PINSEL0 & (0x03 << 4)) | (0x01 << 4);	//scl0 on p0.2
	PINSEL0 = (PINSEL0 & (0x03 << 6)) | (0x01 << 6);	//sda0 on p0.3

	I2C0CONSET = 1<<6;					//1->enable the i2c module
	
}

//send data
uint8_t i2c0Write(uint8_t dat) {
	I2C0DAT = dat;						//write to i2c
	i2c0Wait();							//wait for the transmission to end
	if (I2C0STAT & (1<<8)) return I2C_ACK;
	else return I2C_NOACK;
}

//read data
uint8_t i2c0Read(uint8_t ack) {
	I2C0DAT = 0x00;
	if (ack==I2C_NOACK) i2c0NoAck();
	else i2c0Ack();
	i2c0Wait();

	return I2C0DAT;
}


//initialize i2c1
//master mode only
void i2c1Init(void) {
	uint16_t div;

	PCONP |= 1<<19;					//1->enable clock. 7: i2c0, 19: i2c1

	I2C1CONCLR = 1<<6;				//0->disable the i2c module
	
	//calculate the diver
#if 0								//a simple implementation
	div = F_PHB / F_I2C0 / 2;		//calculate the divider, 16-bit
	if (div < 4) div = 4;			//divider at least 4
	I2C1SCLH = I2C1SCLL = div; 		//equal value for SCLH/SCLL
#else								//a more accurate implementation (70 bytes more in flash :))
	div = (F_PHB + F_I2C0/2) / F_I2C0;	//rounding up
	I2C1SCLH = div/2; if (I2C1SCLH < 4) I2C0SCLH = 4;
	I2C1SCLL = div - I2C1SCLH; if (I2C1SCLL < 4) I2C1SCLL = 4;
#endif

	I2C1STAT = 0;					//clear the flag

	//configure the pins
	PINSEL1 = (PINSEL1 & (0x03 << 2)) | (0x01 << 2);	//scl1 on p0.17
	PINSEL1 = (PINSEL1 & (0x03 << 4)) | (0x01 << 4);	//sda1 on p0.18

	I2C1CONSET = 1<<6;				//1->enable the i2c module
	
}

//end i2c


#if 0
/*
MAPR Bits 7:6 TIM1_REMAP[1:0]: TIM1 remapping
These bits are set and cleared by software. They control the mapping of TIM1 channels 1 to 4, 1N to 3N, external trigger (ETR) and Break input (BKIN) on the GPIO ports.
00: No remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PB12, CH1N/PB13, CH2N/PB14, CH3N/PB15)
01: Partial remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PA6, CH1N/PA7, CH2N/PB0, CH3N/PB1)
10: not used
11: Full remap (ETR/PE7, CH1/PE9, CH2/PE11, CH3/PE13, CH4/PE14, BKIN/PE15, CH1N/PE8, CH2N/PE10, CH3N/PE12)
*/
//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm1Init(uint16_t TxCCP_PS) {
	//route the clock to timer
	//route the clock to timer
	RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;

	//source from internal clock -> disable slave mode
	TIM1->SMCR &=~TIM_SMCR_SMS;			//clear sms->use internal clock

	//stop the timer to configure it
	//TIM1->CR1 &=~TIM_CR1_CEN;			//clear cen. 0=disable the timer, 1=enable the timer
	//TIM1->CR1 &=~TIM_CR1_CKD;			//clear CKD0..1. 0b00->1x clock; 0b01->2:1 clock, 0b10->4:1 clk; 0b11->reserved
	//TIM1->CR1 &=~TIM_CR1_DIR;			//clear DIR bit. 0=upcounter, 1=downcounter
	//TIM1->CR1 &=~TIM_CR1_OPM;			//clear opm bit. 0=periodic timer, 1=one-shot timer
	//or to simply zero the register
	//TIM1->CR1 = 0;						//much easier
	TIM1->CR1 =	(0<<8) |				//0->1:1 clock, 1->2:1 clock, 2->4:1 clock, 3->reserved
				(0<<7) |				//1->APR buffered, 0->APR not buffered
				(0<<5) |				//0->edge-aligned, 1->center-aligned mode 1, 2->center-aligned mode 2, 3->center-aligned mode 3
				(0<<4) |				//0->upcounter, 1->downcounter
				(0<<3) |				//0->continous mode, 1->one pulse mode
				(0<<2) |				//update request source
				(0<<1) |				//0->UEV enabled, 1->UEV disabled
				(0<<0) |				//0->counter disabled, 1->counter enabled
				0x00;
	TIM1->CR2 = 0;						//default value
	TIM1->SMCR= 0;						//default value

	//set the prescaler
	TIM1->PSC = TxCCP_PS - 1;					//set the prescaler
	TIM1->RCR = 0;						//repetition counter = 0 (=no repetition)
	TIM1->ARR = PWM_PR;						//auto reload register / period = 0; - need to change for downcounters
	TIM1->CNT = 0;						//reset the counter

	//clear the status register bits for capture / compare flags
	TIM1->SR &=~(TIM_SR_CC1IF | TIM_SR_CC2IF | TIM_SR_CC3IF | TIM_SR_CC4IF | TIM_SR_UIF);
	//disable the interrupt by clearing the enable bits
	TIM1->DIER &=~(TIM_DIER_CC1IE | TIM_DIER_CC2IE | TIM_DIER_CC3IE | TIM_DIER_CC4IE | TIM_DIER_UIE);

	//configure CCP1..4
#if defined(TIM1CH1toGPIO)
	//configure CCP1
	TIM1->CCMR1 = 	(TIM1->CCMR1 &~0x00ff) |
					(0<<7) |			//0->OC1REF not affedted by ETRF, 1->OC1REF cleared by ETRF high
					(6<<4) |			//0->frozen (for time base), 1->active on match, 2->inactive on match, 3->toggle, 4->inactive, 5->active, 6->pwm mode 1, 7->pwm mode 2
					(0<<3) |			//0->preload disabled, 1->preload enabled
					(0<<2) |			//0->fast disabled, 1->fast enabled
					(0<<0) |			//0->ch1 as output, 1->ch1 as input, 2->ch1 as input, 3->ch1 as input
					0x00;
	TIM1->CCER = 	(TIM1->CCER &~(0x0f << 0)) |
					(0<< 3) |			//0->normal polarity for CC1N, 1->inverse polarity
					(0<< 2) |			//0->disable CC1N, 1->enable CC1N
					(0<< 1) |			//0->normal polarity for CC1, 1->inverse polarity
					(1<< 0) |			//1->enable CC1, 0->disable CC1
					0x00;
	TIM1->CCR1 = 0;						//0% duty cycle

