dannyf00/Arduino-Clone-on-LPC210x/lpc21duino.c
//i2c

//end i2c

//rtcc
//end rtcc
#endif	//xxxxx

//cnint
//global variables
static void (* _exti0_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti1_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti2_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti3_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti4_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti5_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti6_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti7_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti8_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti9_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti10_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti11_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti12_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti13_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti14_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti15_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default

//EXTI0-1 ISR
void EXTI0_1_IRQHandler(void) {
	//clear the flag and execute user isr
	switch (EXTI->PR) {
		case (1<<0): EXTI->PR |= (1<<0); _exti0_isrptr(); break;
		case (1<<1): EXTI->PR |= (1<<1); _exti1_isrptr(); break;
	}
}

//EXTI2-3 ISR
void EXTI2_3_IRQHandler(void) {
	//clear the flag and execute user isr
	switch (EXTI->PR) {
		case (1<<2): EXTI->PR |= (1<<2); _exti2_isrptr(); break;
		case (1<<3): EXTI->PR |= (1<<3); _exti3_isrptr(); break;
	}
}

//EXTI15-10 ISR
void EXTI4_15_IRQHandler(void) {
	//clear the flag and execute user isr
	switch (EXTI->PR) {
		case (1<< 4): EXTI->PR |= (1<< 4); _exti4_isrptr(); break;
		case (1<< 5): EXTI->PR |= (1<< 5); _exti5_isrptr(); break;
		case (1<< 6): EXTI->PR |= (1<< 6); _exti6_isrptr(); break;
		case (1<< 7): EXTI->PR |= (1<< 7); _exti7_isrptr(); break;
		case (1<< 8): EXTI->PR |= (1<< 8); _exti8_isrptr(); break;
		case (1<< 9): EXTI->PR |= (1<< 9); _exti9_isrptr(); break;
		case (1<<10): EXTI->PR |= (1<<10); _exti10_isrptr(); break;
		case (1<<11): EXTI->PR |= (1<<11); _exti11_isrptr(); break;
		case (1<<12): EXTI->PR |= (1<<12); _exti12_isrptr(); break;
		case (1<<13): EXTI->PR |= (1<<13); _exti13_isrptr(); break;
		case (1<<14): EXTI->PR |= (1<<14); _exti14_isrptr(); break;
		case (1<<15): EXTI->PR |= (1<<15); _exti15_isrptr(); break;
	}
}

//global defines
#define EXTI_FALLING	FALLING				//trigger on falling edge
#define EXTI_RISING		RISING				//trigger on rising edge
#define EXTI_BOTH		CHANGE				//trigger on falling and rising edges

//global variables
//initialize the exti
//pin: one pin only
//gpio: GPIOA..GPIOG
void extiInit(GPIO_TypeDef * gpio, uint16_t pin, uint8_t edge) {
	uint16_t tmp;
	//enable afio
	RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;
	//enable the clock
	switch ((uint32_t) gpio) {
#if defined(RCC_AHBENR_GPIOAEN)
		case (uint32_t) GPIOA: RCC->AHBENR |= RCC_AHBENR_GPIOAEN; tmp = 0x00; break;
#endif
#if defined(RCC_AHBENR_GPIOBEN)
		case (uint32_t) GPIOB: RCC->AHBENR |= RCC_AHBENR_GPIOBEN; tmp = 0x01; break;
#endif
#if defined(RCC_AHBENR_GPIOCEN)
		case (uint32_t) GPIOC: RCC->AHBENR |= RCC_AHBENR_GPIOCEN; tmp = 0x02; break;
#endif
#if defined(RCC_AHBENR_GPIODEN)
		case (uint32_t) GPIOD: RCC->AHBENR |= RCC_AHBENR_GPIODEN; tmp = 0x03; break;
#endif
#if defined(RCC_AHBENR_GPIOEEN)
		case (uint32_t) GPIOE: RCC->AHBENR |= RCC_AHBENR_GPIOEEN; tmp = 0x04; break;
#endif
#if defined(RCC_AHBENR_GPIOFEN)
		case (uint32_t) GPIOF: RCC->AHBENR |= RCC_AHBENR_GPIOFEN; tmp = 0x05; break;
#endif
#if defined(RCC_AHBENR_GPIOGEN)
		case (uint32_t) GPIOG: RCC->AHBENR |= RCC_AHBENR_GPIOGEN; tmp = 0x06; break;
#endif
	}
	//configure exti edges
	//1->falling/rising edge enabled, 0->falling/rising edge disabled
	switch (edge) {
		case EXTI_FALLING: 	EXTI->FTSR |= pin; EXTI->RTSR &=~pin; break;
		case EXTI_RISING: 	EXTI->FTSR &=~pin; EXTI->RTSR |= pin; break;
		case EXTI_BOTH: 	EXTI->FTSR |= pin; EXTI->RTSR |= pin; break;
	}
	//configure the port
	switch (pin) {
		case (1<< 0): SYSCFG->EXTICR[0] = (SYSCFG->EXTICR[0] &~0x000f) | ((tmp) <<  0); break;
		case (1<< 1): SYSCFG->EXTICR[0] = (SYSCFG->EXTICR[0] &~0x00f0) | ((tmp) <<  4); break;
		case (1<< 2): SYSCFG->EXTICR[0] = (SYSCFG->EXTICR[0] &~0x0f00) | ((tmp) <<  8); break;
		case (1<< 3): SYSCFG->EXTICR[0] = (SYSCFG->EXTICR[0] &~0xf000) | ((tmp) << 12); break;
		case (1<< 4): SYSCFG->EXTICR[1] = (SYSCFG->EXTICR[1] &~0x000f) | ((tmp) <<  0); break;
		case (1<< 5): SYSCFG->EXTICR[1] = (SYSCFG->EXTICR[1] &~0x00f0) | ((tmp) <<  4); break;
		case (1<< 6): SYSCFG->EXTICR[1] = (SYSCFG->EXTICR[1] &~0x0f00) | ((tmp) <<  8); break;
		case (1<< 7): SYSCFG->EXTICR[1] = (SYSCFG->EXTICR[1] &~0xf000) | ((tmp) << 12); break;
		case (1<< 8): SYSCFG->EXTICR[2] = (SYSCFG->EXTICR[2] &~0x000f) | ((tmp) <<  0); break;
		case (1<< 9): SYSCFG->EXTICR[2] = (SYSCFG->EXTICR[2] &~0x00f0) | ((tmp) <<  4); break;
		case (1<<10): SYSCFG->EXTICR[2] = (SYSCFG->EXTICR[2] &~0x0f00) | ((tmp) <<  8); break;
		case (1<<11): SYSCFG->EXTICR[2] = (SYSCFG->EXTICR[2] &~0xf000) | ((tmp) << 12); break;
		case (1<<12): SYSCFG->EXTICR[3] = (SYSCFG->EXTICR[3] &~0x000f) | ((tmp) <<  0); break;
		case (1<<13): SYSCFG->EXTICR[3] = (SYSCFG->EXTICR[3] &~0x00f0) | ((tmp) <<  4); break;
		case (1<<14): SYSCFG->EXTICR[3] = (SYSCFG->EXTICR[3] &~0x0f00) | ((tmp) <<  8); break;
		case (1<<15): SYSCFG->EXTICR[3] = (SYSCFG->EXTICR[3] &~0xf000) | ((tmp) << 12); break;
	};
}

